[{"url":"Expl_installation/","title":"Software Installation","description":"","tags":["welcome"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 2 title \"Software Installation\" layout \"layout.jlhtml\" tags \"welcome\" description \"\" using Markdown using InteractiveUtils md\"\"\" Installation von Julia und Pluto correct \"Lizenzen\" Julia ist vollständig Open Source, also kostenlos. Anders als bei Matlab Maple müsst ihr nichts kaufen oder eine VPN Verbindung nutzen. Installieren von Julia Wir werden juliaup https github.com JuliaLang juliaup zum installieren von Julia verwenden. Dazu geh in das Terminal deines Rechners und gebe je nach Betriebssystem einen der folgenden commands ein copy pasten ist einfacher . Linux oder macOS ```bash curl fsSL https install.julialang.org | sh ``` Windows Installiere Julia über den Windows store https www.microsoft.com store apps 9NJNWW8PVKMN oder copy paste ```bash winget install julia s msstore ``` in dein Terminal. \"\"\" md\"\"\" correct \"Tipp\" Falls du mit dem Terminal überfordert bist kannst du auch auf den klassischen, grafischen Weg Julia installieren https julialang.org downloads . Falls gar nichts mehr geht, schaut euch dieses Video von Fons https www.youtube.com embed OOjKEgbt8AI an ersten 4 Minuten . 😃 \"\"\" md\"\"\" Starten von Julia \"\"\" md\"\"\" Wenn alles geklappt hat, könnt ihr einfach mit dem Terminal Befehl ```bash julia ``` Julia starten. Alternativ könnt ihr auf die Desktopverknüpfung klicken. Testet ob 1 1 tatsächlich 2 ist. Das ausführen der Zeile erfolgt mit `Enter`. \"\"\" PlutoUI.Resource \"https i.imgur.com IlD8CWL.png\" md\"\"\" Installieren von Pluto \"\"\" md\"\"\" Julia hat einen integrierten Package Manager . Ihr gelangt in den Package Manager Modus indem ihr eine eckige Klammer in das Julia Terminal schreibt ```julia julia v.1.12 pkg ``` Dort angelangt installieren wir Pluto mit dem Befehl nur `add Pluto` ```julia v.1.12 pkg add Pluto ``` Dies kann durchaus einige Minuten in Anspruch nehmen. Habt Geduld ☕️. Anschließend gehen wir zurück in den normalen Julia Modus durch Löschen des `pkg` Symbols. \"\"\" md\"\"\" Nun tippe ```julia julia using Pluto julia Pluto.run ``` um Pluto zu laden und anschließend zu öffnen. Zusammenfassung bei mir ist Pluto bereits installiert weshalb dort no changes steht \"\"\" PlutoUI.Resource \"https i.imgur.com fe9kGv0.png\" md\"\"\" hint \"Gratulation\" Herzlichen Glückwunsch, ihr habt den schwierigsten Part dieser Veranstaltung gemeistert. 🍹 \"\"\" md\"\"\" Was ist Pluto? \"\"\" md\"\"\" Ganz prinzipiell könnten wir Julia komplett im Terminal schreiben. Bloß ist das natürlich extrem unübersichtlich und wenig komfortabel. Aus diesen Grund benötigen wir eine leichte Programmierumgebung für Julia. Anders als in Maple oder Matlab haben wir die freie Hand was wir wählen. Es könnte ein einfacher Texteditor sein oder eine größere Oberfläche wie z.B. VSCode. Für diesen Kurs genügt uns Pluto und damit dein Browser 🙂 \"\"\" md\"\"\" Öffnen von Pluto \"\"\" md\"\"\" Zunächst öffne Julia mittels Terminalbefehl `julia` oder durch deine Desktopverknüpfung. Anschließend können wir immer Pluto starten durch \"\"\" md\"\"\" ```julia julia using Pluto julia Pluto.run ``` \"\"\" md\"\"\" Nun sollte sich dein Standardbrowser öffnen und du gelangst in einen Menü, bei dem du entweder ein neues Plutonotebook erzeugen kannst oder ein bereits existierendes öffnest. \"\"\" md\"\"\" Öffnen von Aufgabenblättern Vorlesungen \"\"\" md\"\"\" Zunächst suche dir dein Aufgabenblatt bzw. die Vorlesung aus, an der du gerne tüfteln möchtest. Nun klicke oben rechts auf Edit or run this notebook . Anschließend kopiere den Link \"\"\" PlutoUI.Resource \"https i.imgur.com cVyD98C.png\" md\"\"\" Nun können wir in der gestarteten Plutoumgebung in der Fläche Open a notebook den Link einfügen und folgend `Enter` drücken. \"\"\" PlutoUI.Resource \"https i.imgur.com h3bykSO.png\" md\"\"\" Jetzt öffnet sich das Notebook und wird ausgeführt, beim allerersten Mal kann das ein wenig Zeit kosten. Zeit für einen weiteren Kaffee Tee. ☕ \"\"\" md\"\"\" Als nächstes wäre es angebracht das Notebook auf deinen Rechner zu speichern. Dazu füge im oberen Kästchen dein Wunschort und Name der Datei .jl am Ende ein und drücke anschließend `Enter`. \"\"\" PlutoUI.Resource \"https i.imgur.com zsLQGzr.png\" md\"\"\" Nun kannst du das Notebook ändern wie du möchtest. Änderungen werden prinzipiell automatisch gespeichert du kannst aber auch mit `STRG S` auf Nummer sicher gehen. Du bist soweit fertig? Damit kommen wir nun zum Export des Plutonotebooks zu einer PDF. Stelle sicher, dass all deine Zellen mit `Shift Enter` ausgeführt wurden. Klicke nun oben rechts auf das Teilen Symbol und anschließend auf PDF. Die PDF kannst du auf StudIP in deinen Aufgabenordner hinzufügen ebenso die .jl Datei wenn du möchtest . \"\"\" PlutoUI.Resource \"https i.imgur.com 1gsmRQD.png\" md\"\"\" Wie funktionieren Pluto Notebooks? \"\"\" md\"\"\" In Pluto haben wir Zellen in denen wir unser Julia Code mittels `Shift Enter` ausführen können. Z.B. \"\"\" x 2 md\"\"\" Um eine neue Zelle zu erzeugen können wir über der alten hovern und die \" \" Symbole links oben unten nutzen um darüber darunter eine neue Zelle zu erzeugen. \"\"\" md\"\"\" Grundsätzlich kennt eine Zelle den Inhalt der anderen Zellen. Wenn wir in der nächsten Zelle also y 5x schreiben, so erscheint als Output 10. Zellen sind also reaktiv . \"\"\" y 5x md\"\"\" Falls ihr mehrere Zeilen Code in eine Zelle stecken wollt, benötigt ihr eine `begin .. end` Umgebung. Dies hat weniger was mit Julia und mehr mit Pluto zutun. Zum Beispiel \"\"\" begin 🍎 3 🍐 10 🍎 🍐 end md\"\"\" Womit wir endgültig Äpfel mit Birnen vergleichen können. Hier erscheint als Ausgabe `true` da 3 tatsächlich kleiner als 10 ist. In Julia können wir auch Smileys einen Variablenwert zuweisen, ebenso \\LaTeX Symbolen. Soviel zur Installation, in den Grundlagen findet ihr mehr Julia 😄. \"\"\" md\"\"\" Misc \"\"\" using PlutoUI TableOfContents "},{"url":"cheatsheets/","title":"Cheatsheets","description":"","tags":["welcome"],"text":"CheatsheetsSchnelleinstieg:Fastrack to Julia cheatsheet.Übersicht für Befehlsunterschiede zwischen Matlab-Python-Julia:MATLAB-Julia-Python comparative cheatsheet by QuantEcon groupMakie Plots:Makie.jl Vorlagen"},{"url":".","title":"index","description":"","tags":["homepage"],"text":""},{"url":"installation/","title":"installation","description":"","tags":[],"text":"First-time setup: Installiere Julia & PlutoVideo Version von Fons (Entwickler von Pluto):Text und Bilder Version:Schritt 1: Installiere Julia 1.8.2Gehe auf https://julialang.org/downloads und downloade die momentan stabile Version, Julia 1.8.2. Achte auf die korrekte Version für dein Betriebssystem (Linux x86, Mac, Windows, etc). Bei Mac: Zusätzlich beachten ob du einen M-Prozessor besitzt oder ein Intel-Prozessor (Für Info: Apple-Symbol –> Über diesen Mac).Schritt 2: Run JuliaNach der Installation, stelle sicher, dass du Julia ausführen kannst. Auf manchen Systemen, ist dies verknüpft mit der einfachen Suche nach dem Programm “Julia 1.8.2” und anschließenden ausführen; in anderen, musst du den Befehl julia im Terminal eingeben. Nach der Ausführung stelle sicher, dass 1 + 1 tatsächlich 2 ist:Schritt 3: Installiere PlutoAls nächstes installieren wir Pluto, eine Notebook Umgebung die wir im Laufe des Praktikas nutzen werden. Pluto ist eine Julia Programmierumgebung die extra für Interaktivität und schnelle Experimente von **\nFons van der Plas** entwickelt wurde.Öffne das Julia REPL. Dies ist ein command-line interface für Julia, siehe auch den vorherigen Screenshot.Hier kannst du Julia Kommandos, eintippen und anschließend ENTER drücken, dann läuft es, und du siehst das Resultat.Um Pluto zu installieren, müssen wir ein package manager command eingeben. Um vom Julia Modus zum Pkg Modus zu wechslen tippe ] (geschlossene eckige Klammer) nachdem julia> Feld:\njulia> ]\n\n(@v1.8) pkg>\nDie Zeile wird nun blau gefärbt sein und das linke Feld wechselt zu pkg>, was andeutet, dass du dich im package manager mode befindest. Dieser Modus erlaubt es dir Operationen auf packages (auch libraries, oder deutsch Pakete genannt) auszuführen.Um Pluto zu installieren, führe das folgende (sensibel auf Groß-/Kleinschreibung) Kommando aus add (install). Du solltest dies nur einmal pro Installtion von Julia machen müssen.\n(@v1.8) pkg> add Pluto\nDies könnte einige Minuten in Anspruch nehmen, zuhören und Kaffee trinken!Du kannst nun das Terminal schließen.Schritt 4: Nutze modernen browser: Mozilla Firefox / Google ChromeFirefox und Chrome sind für diesen Kurs bzw. Pluto Notebooks am besten geeignet.Zweite Mal: Führe Pluto aus & öffne ein Pluto-NotebookWiederhole die folgenden Schritte, wenn du an einen Projekt oder deinen Aufgabenblatt arbeiten möchtest.Schritt 1: Starte PlutoStarte die Julia REPL, wie du es auch schon bei dem first-time setup getan hast. Im REPL tippe:julia> import Pluto; using Pluto\n\njulia> Pluto.run()\nDas Terminal wird dir dann sagen zu http://localhost:1234/ (oder ähnliche URL) zu gehen. Lasst uns also Firefox oder Chrome öffnen und fügt die URL in die Adressbar ein.Schritt 2a: Öffne ein Notebook aus dem WebThis is the main menu - here you can create new notebooks, or open existing ones. Our homework assignments will always be based on a template notebook, available in this GitHub repository. To start from a template notebook on the web, you can paste the URL into the blue box and press ENTER.For example, homework 0 is available here. Go to this page, and on the top right, click on the button that says “Edit or run this notebook”. From these instructions, copy the notebook link, and paste it into the box. Press ENTER, and select OK in the confirmation box.The first thing we will want to do is to save the notebook somewhere on our own computer; see below.Step 2b: Opening an existing notebook fileWhen you launch Pluto for the second time, your recent notebooks will appear in the main menu. You can click on them to continue where you left off.If you want to run a local notebook file that you have not opened before, then you need to enter its full path into the blue box in the main menu. More on finding full paths in step 3.Step 3: Saving a notebookWe first need a folder to save our homework in. Open your file explorer and create one.Next, we need to know the absolute path of that folder. Here’s how you do that in Windows, MacOS and Ubuntu.For example, you might have:C:\\Users\\fons\\Documents\\18S191_assignments\\ on Windows/Users/fons/Documents/18S191_assignments/ on MacOS/home/fons/Documents/18S191_assignments/ on UbuntuNow that we know the absolute path, go back to your Pluto notebook, and at the top of the page, click on “Save notebook…”.This is where you type the new path+filename for your notebook:Click Choose.Step 4: Sharing a notebookAfter working on your notebook (your code is autosaved when you run it), you will find your notebook file in the folder we created in step 3. This the file that you can share with others, or submit as your homework assignment to Canvas.\nconst run = f => f();\nrun(async () => {\nconst versions = await (await fetch(`https://julialang-s3.julialang.org/bin/versions.json`)).json()\nconst version_names = Object.keys(versions).sort().reverse()\nconst stable = version_names.find(v => versions[v].stable)\nconsole.log({stable})\nconst pkg_stable = /\\d+\\.\\d+/.exec(stable)[0]\ndocument.querySelectorAll(\"auto-julia-version\").forEach(el => {\n    console.log(el)\n    el.innerText = el.getAttribute(\"short\") == null ? stable : pkg_stable\n})\n});"},{"url":"orga/","title":"Kurslogistik","description":"","tags":["welcome"],"text":"Computerorientierte Mathematik, Algorithmen & Strukturen\n\n        Praktika in  Julia\n    \n        Universität Rostock, Institut für Mathematik, Winter 2025/26Willkommen in der Julia-Praktikumsgruppe der CAS-Vorlesung im Wintersemester 2025/2026. Auf dieser Homepage werdet ihr eine Übersicht\nzur Julia-Syntax erhalten. Zudem werden hier eure Pluto-Notebooks zur Bearbeitung der Aufgaben bereitgestellt. Außerdem versuche ich\nbevor die Vorlesung stattfindet, hier auch den entsprechenden Julia Code im “Lehrmaterial” Reiter bereitzustellen.\n    Man sollte dennoch die Vorlesung besuchen, denn dort werden vorallem mathematische Konzepte aufgezeigt.  \nRandbedingungenHardwareUnser Praktikumsraum Haus 1, Raum 227 besitzt Windows-PCs.Praktika findet wöchentlich mittwochs um 1300 Uhr ☕️ statt.Liebend gern könnt ihr eure eigenen Rechner mitbringen (MacOS, Linux oder Windows) - wir benötigen keine Software-LizenzenAbgabenGenereller Ablaufplan sieht vor, dass wir die meisten Aufgaben des Aufgabenblattes in diesem Praktika gemeinsam bearbeiten und diskutieren. Die unterstrichene Aufgabe auf dem Blatt ist eine Hausaufgabe, die Ihr entweder, falls ihr euch langweilt, hier alleine lösen könnt oder zuhause.Ihr habt immer eine Woche Zeit das Aufgabenblatt zu bearbeiten und vollständig als PDF und jl File im “Aufgaben”-Menü der Vorlesungsveranstaltung auf StudIP hochzuladen. Wie funktioniert das? Schaut euch den Reiter “Software Installation” und den dortigen Text an. 😉 Werde ich euch auch in Ruhe erklären.Es soll nicht nur die Hausaufgabe, sondern das gesamte Aufgabenblatt abgegeben werden.Nach der Abgabe werden, im Laufe von einer Woche, Hinweise im selbigen “Aufgaben”-Menü auftauchen. Dort wird prinzipiell stehen ob die Abgabe den Anforderungen genügt oder nicht. Falls letzteres eintritt, stehen dort Verbesserungsvorschläge / Tipps die bei der späteren Abgabe des Portfolios zu berücksichtigen sind.Praktikumsbericht / PortfolioAm Ende der Veranstaltung alle (vollständigen) Aufgabenblätter als pdf zusammenführen und abermals in den “Aufgaben”-Menü hochladen.Es gibt keine schriftliche Klausur.AnwesenheitJeder muss mindestens 12 von 14 Seminaren / Praktika besuchen.Bei Krankheit bitte mir Bescheid geben und dann Zettel Frau S. Neumann übermitteln.Hilfe / FragenFalls ihr Fragen zu Julia / dieser Website habt, meldet euch bei mir per Mail: hannes.wallner@uni-rostock.de oder versucht mich im Büro: Haus 3, Raum 325 anzutreffen.Ich habe ein Typo / Fehler gefunden!Für den Experten: Erstellt ein Issue auf GitHub oder noch besser für git-Experten: Erstellt ein Merge Request mit potentiellen fix. Das GitHub Repository ist hier zu finden: https://github.com/HaneWall/CAS23ansonsten einfach mir eine Mail schreiben oder im Praktika ansprechenIch wünsche euch viel Spaß und Erfolg,\ncheers Hannes"},{"url":"search/","title":"Search results","description":"","tags":[],"text":"window.init_search();SearchResults\nLoading..."},{"url":"sidebar data/","title":"sidebar data","description":"","tags":[],"text":"Dict main \"Willkommen\" collections \"welcome\" .pages, \"Grundlagen Julia\" collections \"preliminaries\" .pages, \"Lehrmaterial\" collections \"assignments\" .pages, \"Vorlesungen\" collections \"lecs\" .pages, \"Module 3 Climate Science\" collections \"module3\" .pages, , about Dict authors name \"Prof. Jens Starke\", url \"http www.jstarke.eu\" , name \"Hannes Wallner\", url \"https github.com HaneWall\" , , title \"CMAS Julia\", subtitle \"Computerorientierte Mathematik, Algorithmen und Strukturen\", term \"Winter 2025 2026\", institution \"Universität Rostock\", institution url \"http www.uni rostock.de\", institution logo \"black logo uni julia.svg\", institution logo darkmode \"white logo uni julia.svg\", , "},{"url":"whyjulia/","title":"Warum Julia?","description":"","tags":["welcome"],"text":"Warum Julia?Hier die eventuell amüsante, aber dennoch ernstzunehmende Beantwortung der Entwickler vom MIT, welche die Sprache 2012 veröffentlichten:\n           Auszug Julia Manifest 2012\n    In short, because we are greedy.  \nWe are power Matlab users. Some of us are Lisp hackers. Some are Pythonistas, others Rubyists, still others Perl hackers. There are those of us who used Mathematica before we could grow facial hair. There are those who still can’t grow facial hair. We’ve generated more R plots than any sane person should. C is our desert island programming language. \n \nWe love all of these languages; they are wonderful and powerful. For the work we do — scientific computing, machine learning, data mining, large-scale linear algebra, distributed and parallel computing — each one is perfect for some aspects of the work and terrible for others. Each one is a trade-off. \n \nWe are greedy: we want more. \n \nWe want a language that’s open source, with a liberal license. We want the speed of C with the dynamism of Ruby. We want a language that’s homoiconic, with true macros like Lisp, but with obvious, familiar mathematical notation like Matlab. We want something as usable for general programming as Python, as easy for statistics as R, as natural for string processing as Perl, as powerful for linear algebra as Matlab, as good at gluing programs together as the shell. Something that is dirt simple to learn, yet keeps the most serious hackers happy. We want it interactive and we want it compiled. \n \n(Did we mention it should be as fast as C?)Das klingt alles sehr hochtrabend - elf Jahre später und fünf Jahre nach Julia 1.0 (quasi noch ein Baby in der Informatik) muss man jedoch sagen, dass es Ihnen im Großen und Ganzen gelungen ist, eine kompetetive Programmiersprache zu entwickeln, die den Tod von zumindest Matlab besiegeln könnte.Warum Julia in diesen Kurs?Im Laufe eures Studiums werdet ihr vorallem mit Matlab, Python oder Julia bzw. allgemein mit dem numerischen Programmieren in Berührung kommen. Folglich ist es sinnvoll bereits hier mit Julia (bzw. Matlab - nahezu gleiche Syntax) anzufangen. Computeralgebrasysteme wie Maple verfolgen hingegen eine andere Philosophie und versuchen mit symbolischen Umformungen und analytischen Ergebnissen zu glänzen. Definitiv besitzen beide Herangehensweisen ihre Daseinsberechtigung, jedoch haben numerische Verfahren deutlich größere Anwendungsbereiche (siehe unten Industrie & Bildung).Ist die Wahl der Programmiersprache endgültig?Nein, keineswegs! Der typische Weg ist in etwa so: Man lernt eine Sprache sehr gut kennen und lernt grundlegende Prinzipien, Muster bzw. Konzepte. In dieser Sprache fängt man dann an Probleme zu lösen und Projekte fürs Studium zu bearbeiten. Über die Zeit werdet Ihr dann durch das Internet, andere Kurse oder Kommilitonen auf andere Programmiersprachen treffen, in der das spezifische Problem noch viel leichter zu lösen ist. Also war dann alles umsonst? Nein! Die Muster und die Syntax sind in allen Sprachen ziemlich nah aneinander. Wenn Ihr den Namen des Musters/Konzepts bzw. der Syntax beherrscht könnt ihr mit einfachen googlen eine neue Programmiersprache lernen! Jede weitere Programmiersprache ist dann nur noch Formsache.The Two-Language ProblemInnerhalb der Industrie und Forschung gibt es seit vielen Jahrzehnten ein Problem. Häufig möchte man ein Sachverhalt verstehen und simulieren und greift somit zu einer Skriptsprache wie Python/Matlab/R, um schnell einen Prototypen zu entwickeln. Funktioniert dieser, wird der gesamte Prototyp in eine performantere, kompilierte Sprache wie C oder Rust umgeschrieben. Dieser Entwicklungsprozess kann sehr lange dauern.Im Laufe der letzten 10 Jahre kam es dann zur einer Popularitätsexplosion von Python, da man eine vermeidliche Lösung für dieses Problem fand. Python war schon immer durch seine kinderleichte Syntax bekannt, ist jedoch selbst äußerst langsam. Aus diesem Grund schummelt man nun in Python etwas und importiert direkt C-Pakete (z.B. NumPy, TensorFlow oder PyTorch) um seine Berechnungen durchzuführen. Demnach wird Python quasi als leichte Benutzeroberfläche von C genutzt. Man kann sich vorstellen, dass dies erstmal einen ordentlichen Performanceboost mit sich bringt, aber man auch schnell auf Grenzen stößt und nie ganz an die Performance von kompilierten C herankommt bzw. man einfach nicht die gleiche Flexibilität besitzt, wie bei einen reinen C Projekt. Eine wirklich elegante Lösung ist das also nicht.Hier kommt nun Julia ins Spiel und überzeugt mit ähnlicher Performance zu C, nativen Paketen und einer Syntax die im Sweetspot zwischen C, Matlab und Python einzuordnen ist. Darüberhinaus kann Julia nativ Grafikkarten (CUDA) für Berechnungen nutzen und ist damit bestens für Supercomputer/ High-Performance-Computing geeignet. Julia ist in Julia selbst und C geschrieben und vollständig Open-Source (also auch kostenlos). Diese Politik führt dazu, dass jeder aktiv die Sprache mitgestalten und weiter optimieren kann. Durch die leichte Syntax Julia`s können wir also schnell Prototypen erstellen, die dann mittels Optimierung des Codes noch in der selben Sprache zu einen echten Produkt heranreifen können.IndustrieDer größte Vermögensverwalter der Welt BlackRock setzt bei seinen Datenanalysesystem Aladdin auf Julia.ASML, bekannt durch seine Lithografieverfahren (die es ermöglichen Computerchips herzustellen - Thema der Weltpolitik), wechseln seit zwei Jahren von Matlab und Python zu Julia. Inzwischen hat ASML über 130 private Julia Verzeichnisse auf GitHub, natürlich alle streng geheim.Amazon nutzt Julia für Quantum Computing. Dies ist vermutlich die Zukunft der ganzen, noch sehr jungen, Branche da die hier entwickelten Pakete nur in Julia existieren.Seit 2022 wertet CERN Daten vom Large-Hydron-Collider mit Julia aus.Intel, IBM, Apple, NASA .. sind alle aktive Sponsor der Sprache und adoptieren in bestimmten Bereichen zu Julia.Bildung & ForschungDie große Forschungsgruppe Modelling Climate Alliance produziert ein State-of-the-Art Paket für die Simulation des Weltklimas in Julia.Die Verbindung von Big Data mit rasanten Algorithmen in Julia, erlaubt es vorallem in der Pharmaindustrie (Moderna, Pfizer, AstraZeneca) schneller Medikamente zu entwickeln.Die renomiertesten Universitäten wie z.B. MIT, Stanford, UC Berkeley, Brown, ETH Zurich etc. bieten alle Kurse in Julia an (jetzt auch in Rostock!)Übrigens diese Website wurde auch mit Julia gebaut, cheers Hannes"},{"url":"week_0/arrays/","title":"Arrays","description":"","tags":["preliminaries"],"text":" A Pluto.jl notebook v0.20.19 frontmatter chapter 3 order 3 title \"Arrays\" layout \"layout.jlhtml\" tags \"preliminaries\" description \"\" using Markdown using InteractiveUtils using LinearAlgebra using PlutoUI md\" `Array`s\" md\"\"\" `Array`s sind gewissermaßen das Fundament der computerorientierten Mathematik. Sie erlauben es uns mehrere Werte zu speichern und auszulesen. \"\"\" md\"\"\" warning \"Hinweis\" In Julia gibt es auch die Struktur `tuple`. Diese können ebenfalls Daten speichern sind aber nach der Initialisierung nicht mehr veränderbar. In diesen Kurs benötigen wir vorerst nur `Array`s. \"\"\" md\" 1D `Arrays`\" md\"\"\" Wir können ein eindimensionales `Array` 1 dimensional, oder 1D `Array` durch eckige Klammern ` ` erzeugen. \"\"\" v 1, 3, 5 typeof v md\"\"\" Die `1` im Typen zeigt die Anzahl der Dimensionen. Ausgesprochen `v` ist ein 1D array, welches Elemente vom Typen `Int64` beherbergt. Fundamental bei Arrays Wir können deren Elemente einsehen und ändern. Zum Beispiel können wir durch `array index ` uns das Element an der Position `index` des Arrays ausgeben lassen. \"\"\" v 2 md\"\"\" warning \"Hinweis\" Anders als in Python oder C, fangen in Julia Matlab die `Indizes` bei 1 und nicht bei 0 an. Das macht es für Naturwissenschaftler schöner und für Informatiker wohlmöglich hässlicher. \"\"\" md\"\"\" Natürlich können wir auch das Element an zweiter Stelle ändern \"\"\" v 2 10 v md\"\"\" `Array` `List` comprehensions \"\"\" md\"\"\" Eine äußerst elegante Art und Weise `Array`s zu erzeugen ist das sogenannte array comprehension Muster in Python list comprehension . Dabei verbinden wir eine For Schleife mit der Konstruktion eines `Array`s. Z.B. alle Quadratzahlen von 1 bis 10 als 1D `Array` \"\"\" v2 i^2 for i in 1 10 md\"\"\" Die Alternative Zunächst erstellen wir ein 10 Elemente langes Array aus Nullen vom Typ `Int64`. \"\"\" v3 zeros Int64, 10 md\"\"\" Anschließend iterieren wir mittels `for` Schleife über die `Indizes` des `Array`s und verändern die Elemente zu den gewünschten Quadratzahlen. \"\"\" begin for idx in 1 10 v3 idx idx^2 end v3 end md\"\"\" `Array` Slicing \"\"\" md\"\"\" Sagen wir, wir möchten ein Stück aus dem ehemaligen `Array` extrahieren. Spezifischer wir möchten ein neues Array `v4` erzeugen welches dem ursprünglichen `v3` vom `Index` 3 bis 7 entspricht Grenzen inkludiert . Dies können wir durch den ` ` Operator innerhalb der eckigen Klammer gewährleisten. \"\"\" v4 v3 3 7 md\"\"\" Ab und an kommt es vor, dass man eventuell nur jedes `n` te Element des ursprünglichen `Array`s benötigt. Dafür nutzen wir dann die slicing Syntax, bei der wir zwischen den `Start` und `Stop` `Index` zusätzlich eine Schrittweite `Step` hinzufügen. `array Start Step Stop ` . Z.B. nur jedes `2` te Element des Quadratzahlenarrays \"\"\" v3 v5 v3 1 2 10 md\"\"\" correct \"Tipp\" Niemand hält uns ab rückwärts zu zählen. \"\"\" v3 v6 v3 10 2 1 md\"\"\" hint \"Verständnisfrage Warum ist v6 nicht v5, bloß umgekehrt?\" Das liegt daran, dass wir immer bei `Start` anfangen zu zählen. Bei `v5` starten wir bei `Index` 1 und und rechnen immer ` 2` bis `10` erreicht wird. Bloß wird 10 nie erreicht, sondern nur der `Index` 9, also Element 81. Einen `Index` 11 gibt im 10 Element `Array` nicht, folglich stoppt das slicing . Bei `v6` hingegen starten wir bei `Index` 10, also Element 100, erreichen aber aus selbigen Grund nur `Index` 2 und nicht `Index` 1. \"\"\" md\"\"\" Konstruktion von `Arrays` mit festgelegter Schrittweite \"\"\" md\"\"\" Mithilfe der Slicing Syntax können wir in Julia auch `Array`s konstruieren. Zunächst bastelt man sich eine range mittels `r Start Step Stop`, diese kann dann anschließend mittels `collect r ` zu einen `Array` umgeformt werden. Zum Beispiel hier die Erzeugung eines 1D `Array`s, dessen Elemente von 1 bis 19 mit einer Schrittweite von 3 reichen. \"\"\" arr collect 1 3 19 md\" Auch ein haüfiges Szenario Wir kennen den `Start` und `Stop` eines equidistanten Gitters, aber nicht die Schrittweite sondern nur die Länge des `Array`s. Sicherlich könnte man dann die Schrittweite errechnen, einfacher ist es jedoch den `range ` Befehl zu nutzen. Hier z.B. ein equidistantes Gitter von 1 bis 12, welches 7 Elemente beherbergt. \" arr2 collect range 1, 12, length 7 md\" Broadcasting Funktionen auf `Array`s anwenden \" md\" Sagen wir, wir haben ein 1D `Array` namens `zahlen`. Von jeden Element in `zahlen` möchten wir das Quadrat bilden und anschließend minus eins rechnen. \" zahlen collect 1 10 md\" Also basteln wir uns eine Funktion namens `quadrat minus eins` die eine Variable `d` einliest, diese quadriert und anschließend minus Eins rechnet. \" function quadrat minus eins d return d^2 1 end md\" Wenn wir nun versuchen das gesamte `Array` zahlen der Funktion zu übergeben bekommen wir einen Error, da die Funktion davon ausgeht, dass sie nur ein einziges Element bekommt und nicht ein ganzes `Array`. \" quadrat minus eins zahlen md\" Genauer formuliert bekommen wir einen Fehler, da der Potenzoperator `^` nicht weiß, wie er mit einen Vektor bzw. einen 1D `array` umzugehen hat. Um dieses Problem zu lösen müssen wir der Funktion mitteilen, dass sie jedes Element des `Array`s zahlen einzeln einlesen und verarbeiten soll. In Julia auch in MATLAB wird dies durch ein Punkt `.` zwischen Funktionsname und den runden Klammern kenntlich gemacht. \" vals quadrat minus eins. zahlen md\"Allgemein spricht man hier von der sogenannten Broadcast Syntax.\" md\" Beispiel Sinus Array Bauen wir ein feines Gitter mit der Schrittweite 0.01, welches sich von 0 bis 2π ersteckt. Anschließend wollen wir den Sinus an jeden Gitterpunkt ausrechnen. \" args collect 0. 0.01 2π md\"Nun rechnen wir an jeden Gitterpunkt den sin aus \" y sin. args md\" Das dies wirklich der Sinus ist, müsst ihr mir bis hierhin glauben. Eine grafische Darstellung ist im Plots Kapitel zu sehen. \" md\"\"\" Beispiel Multiplikation & Addition \"\"\" md\" Um zwei Vektoren elemtweise miteinander zu multiplizieren oder zu addieren benötigen wir ebenfalls die Broadcast Syntax mit einen Punkt `.` vor der Operation Funktion. \" let a 1, 2, 3 b 4, 5, 6 c a . b end md\" Hingegen das Skalarprodukt durch `dot a, b ` berechnet wird. Hierbei nutzen wir das oben geladene `LinearAlgebra` Paket. \" let a 1, 2, 3 b 4, 5, 6 c dot a, b end md\"Elementweise Addition \" let a 1, 2, 3 b 4, 5, 6 c a . b end md\" Längenmanipulation eines Arrays \" md\" Häufig möchten wir die Länge eines `Array` über die Zeit ändern, z.B. um ein Element ergänzen. In Julia kann man dies leicht durch die Befehle `push ` und `pop ` durchführen. Die Ausrufezeichen weißen dabei darauf hin, dass wir aktiv das `Array` verändern und keine Kopie erzeugen. \" md\" Verlängern\" md\" Erstellen von Array von 1 bis 10 \" q collect 1 10 md\"Anfügen engl. pushen von einen Element an letzter Stelle \" push q, 11 md\" Wie wir sehen haben wir q nachhaltig verändert \" q md\"Nun möchten wir noch eine 0 an erster Stelle anfügen, also `pushfirst ` \" pushfirst q, 0 md\" Verkürzen\" md\" Auf äquivalente Art und Weise können wir Arrays verkürzen und Elemente rausschmeisen engl. informatik pop . Auch hier wird hinten angefangen \" pop q q md\" Man kann aber auch vorne Elemente rausschmeissen, also `popfirst ` \" popfirst q q md\" Mittendrin löschen einfügen \" md\" Lasst uns das Element am `Index` 3 löschen. Hier ist zufällig auch das Element gerade 3 \" deleteat q, 3 q md\" Wir können auch ganze Streifen löschen. Lasst uns weiterhin die Elemente von q an den `Indizes` 3 bis 5 löschen. \" deleteat q, 3 5 q md\" Ganz schöne Sauerei, lasst uns q wieder ab den dritten `Index` mit den richtigen Werten auffüllen. \" for idx in 3 6 Syntax insert Array, Index, Element insert q, idx, idx end q md\" 2D `Arrays`\" md\"\"\" 1D `Array`s werden schnell langweilig. Lasst uns nun 2D `Array`s anschauen, die sehr häufig benötigt werden. Ihr werdet feststellen das mit dem Vorwissen von 1D `Array`s der Sprung zu ND `Array`s nur minimal ist. Man kann auf ganz verschiedene Art und Weisen ein 2D `Array` bzw. eine Matrix erzeugen. Alle sind äquivalent \"\"\" M 1 2 3 4 M₂ 1 2 3 4 md\"\"\" Mittels Spaltenvektoren \"\"\" M₃ 1, 3 2, 4 typeof M md\"Die `2` im Typen bestätigt, dass es sich tatsächlich um ein 2D `Array` handelt\" md\"\"\" Die Navigation innerhalb eines 2D `Array`s ist identisch zum eindimensionalen Fall. Da wir nun in zwei Dimensionen arbeiten benötigen wir jedoch für die Position zwei `Indizes`. Der erste `Index` deklariert die Zeile in der wir arbeiten und der zweite `Index` die Spalte. `array row, column ` bzw. deutsch `array Zeile, Spalte ` \"\"\" M M 1, 1 M 1, 2 md\"\"\" Natürlich funktioniert auch hier slicing . \"\"\" M 1, 1 2 M 1 2, 2 md\"\"\" Auch hier können wir natürlich Werte ändern. \"\"\" M 1 2, 2 7, 7 M md\"\"\" Vorgefertigte Arrays \"\"\" md\"\"\" Für große Matrizen ist es wenig sinnvoll, diese per Hand zu definieren. Hier greift man auf bereits vorgefertigte Konstruktionen von Julia zurück. Z.B. können wir eine Matrix ein 2D `Array` voller Nullen durch den Befehl `zeros TYP, Anzahl Zeilen, Anzahl Spalten ` initialisieren. \"\"\" zeros 3, 5 md\"Wenn wir kein TYP angeben, so geht Julia davon aus das wir Gleitkommazahlen `Float64` meinen. Möchten wir hingegen ganze Zahlen `Integer` so können wir dies durch den TYP festlegen.\" einmaleins zeros Int64, 5, 5 md\"Jetzt könnte man mittels zweier in sich gekopppelter `for Schleifen` über die `Indizes` iterieren und somit die Matrix auffüllen. Hier z.B. eine 1×1 Tabelle bis 5 \" begin for zeilen idx in 1 5 for spalten idx in 1 5 einmaleins zeilen idx, spalten idx zeilen idx spalten idx end end einmaleins end md\"\"\" Das kleine 1×1 mittels array comprehension \"\"\" md\"Eine sehr nette und elegante Alternative ist abermals das array comprehension Muster. Hier das 1×1 bis 12 durch eine einzige Zeile Code.\" bigeinmaleins zeile spalte for zeile in 1 12, spalte in 1 12 md\"\"\" Broadcasting bei 2D Arrays \"\"\" md\"Natürlich gibt es noch viele andere vorgefertigte Arrays. Hier z.B. ein 2D `array` voller einsen, welches wir anschließend mittels Broadcasting der Multiplikation zu einen 2D `array` voller Sechsen verwandeln.\" einsen ones Int64, 6, 6 six 6 . einsen md\"\"\" danger \"Dot Operationen Broadcasting sind äußerst wichtig\" Ein fehlender Punkt vor der jeweiligen Operation Funktion kann zu sehr unangenehmen Fehlern führen. \"\"\" md\"\"\" Es ist wichtig zu betonen, dass man sich genau überlegen muss welche Operation man gerade benötigt. Hier z.B. eine Matrixmultiplikation von 2 Matrizen `A` und `B` \"\"\" A 1 2 5 9 B 4 3 2 7 C mm A B md\"\"\" Hingegen die elementweise Multiplikation durch ein `.` durchgeführt wird \"\"\" C em A . B TableOfContents "},{"url":"week_0/firststeps/","title":"Erste Schritte","description":"","tags":["preliminaries","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"0\" order 4.5 title \"Erste Schritte\" layout \"layout.jlhtml\" tags \"preliminaries\", \"homeworks\" using Markdown using InteractiveUtils html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Erste Schritte in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Lernziele erster Kontakt mit dem PC Pool und Ihren Kommilitonen ? D und mit der gewählten Programmiersprache Software Installation von Julia und Pluto Öffnen und Nutzen von Julia und Pluto Öffnen Bearbeiten Speichern von Aufgabenblättern \"\"\" md\"\"\" Pakete, die wir heute brauchen \"\"\" begin using CairoMakie zum Plotten CairoMakie.activate type \"png\" end md\"\"\" Teil 1 Installation auf Computer Ihrer Wahl \"\"\" md\"\"\" Aufgabe 1 Gehen Sie auf dieser Website auf den Reiter `Software Installation` und folgen Sie dortigen Schritte. Anders als bei der Maple und Matlab Gruppe, ist Julia Open Source und Sie können es kostenlos auf Ihren Computer laden und nutzen sinnvoll fuer Hausaufgaben 😉 . \"\"\" md\"\"\" Teil 2 Aufgabenblätter öffnen \"\"\" md\"\"\" Aufgabe 2 Öffnen Sie dieses Aufgabenblatt auf Ihren Rechner, indem Sie oben rechts auf `Edit or run this notebook` klicken und den Anweisungen in den `Software Installation` Reiter folgen. Arbeiten Sie nachfolgend im Pluto geöffneten File dieses Aufgabenblattes weiter. \"\"\" md\"\"\" Teil 3 Erste Schritte in Julia & Pluto \"\"\" md\"\"\" Never forget Scrollen Sie nach ganz oben und legen Sie im oberen Kasten fest, wo Sie diese Datei lokal speichern möchten. Drücken Sie ab und zu ` cmd s ` zum zwischenspeichern. \"\"\" md\"\"\" Aufgabe 3.1 Erstellen Sie 3 leere Pluto Zellen indem Sie über diese Zelle mit der Maus hovern und unten links auf das ` ` Symbol klicken. Zwischen Aufgabe 3a und 3b sollten nun 3 leere Zellen erscheinen. \"\"\" md\"\"\" Aufgabe 3.2 Löschen Sie nun die in Aufgabe 3a erstellten Pluto Zellen wieder, indem Sie bei der jeweiligen Zelle rechts auf die 3 Punkte klicken. \"\"\" md\"\"\" Aufgabe 3.3 Erstellen Sie unterhalb dieser Aufgabe eine Zelle und weisen Sie der Variablen `a` den Wert 2 zu und drücken Sie ` shift enter ` zum Ausführen. Schauen Sie sich notfalls auf der Website den Reiter `Variablen und Funktionen` an. \"\"\" md\"\"\" Aufgabe 3.4 Erstellen Sie unterhalb dieser Aufgabe nur eine Zelle und weisen Sie der Variablen `b` den Wert 3, `c` den String \"Hallo\" und `d` den String \"Welt \" zu. Nutzen Sie eine `begin..end` Umgebung, wie im Abschnitt `Variablen und Funktionen` der Website oder `Code 1. Vorlesung` beschrieben. \"\"\" md\"\"\" Aufgabe 3.5 Nachfolgend werde ich das Erstellen von Zellen nicht mehr erwähnen D. Weisen Sie der Variablen `t` den Wert `c d` zu. \"\"\" md\"\"\" Aufgabe 3.6 In der vorherigen Aufgabe entstand ein zusammengeklatschtes Wort. Erstellen Sie eine neue Variable `satz` mit Leerzeichen zwischen beiden Wörtern, indem Sie die Variablen `c`, `d`, ein mit Leerzeichen gefüllten String \" \" und zweimal den ` ` Operator nutzen. \"\"\" md\"\"\" Aufgabe 3.7 Perfekt. Nun geben Sie Variable `satz` mithilfe des ` info` Macros und einer `for` Schleife 6 mal aus. \"\"\" md\"\"\" Aufgabe 3.8 Widmen wir uns nun Funktionen. Erstellen Sie eine Funktion `f`, welche eine Zahl `x` einliest und `2 x` ausgibt. Schauen Sie sich dafür den Abschnitt `Variablen und Funktionen` der Website an. \"\"\" md\"\"\" Aufgabe 3.9 Werten Sie die Funktion `f` an den Stellen x 0 , x 3 sowie x 5 nacheinander aus. \"\"\" md\"\"\" Aufgabe 3.10 Erstellen sie mittels `x Float64 ` einen leeren Vektor bzw. ein leeres Array. Fügen Sie nun mittels `push x, ZAHL ` die Zahlen 0, 3 und 5 in `x` ein. \"\"\" md\"\"\" Aufgabe 3.11 Werten Sie die Funktion `f` an allen Stellen des Arrays `x` aus, mittels `f. x `. \"\"\" md\"\"\" Aufgabe 3.12 Erstellen Sie eine Funktion g y \\frac sin y y . \"\"\" md\"\"\" Aufgabe 3.13 Erstellen Sie eine 100 Zahlen lange range , also eine äquidistant getrennte Spanne von Zahlen zwischen 0.1 und 50, mittels `y range ANFANG, ENDE, length LÄNGE ` \"\"\" md\"\"\" Aufgabe 3.14 Plotten Sie die Funktion g y mithilfe Ihrer Stützstellen `y`, durch `scatterlines y, g. y , color cornflowerblue ` \"\"\" md\"\"\" Aufgabe 3.15 Das wars mit den heutigen Aufgaben 😎. Spielt ein wenig mit der Funktion `g y ` und den Anfangs, Ende und length Attributen der `range` und seht wie sich die Abbildung live ändert length nicht zu groß wählen . Springt danach zu Teil 4. \"\"\" md\"\"\" Teil 4 Abgabe des Aufgabenblattes \"\"\" md\"\"\" Export 1.1 Scrollen Sie nach ganz oben und drücken Sie auf das Teilen Symbol. Exportieren Sie anschließend das Notebook als pdf. Diese pdf können Sie nun auf StudIP bei der Vorlesung im Aufgabenreiter hochladen. Dort wird Ihnen auch Feedback bereitgestellt. \"\"\" md\"\"\" Export 1.2 Scrollen Sie nach ganz oben und drücken Sie auf das Teilen Symbol. Exportieren Sie anschließend das Notebook als Notebook file. Ich empfehle Ihnen auch diese Datei immer in Ihren Aufgabenordner hochzuladen, damit Sie es anschließend zuhause herunterladen und bearbeiten können wenn nicht bereits auf eigenen Computer bearbeitet \"\"\" "},{"url":"week_0/loopcond/","title":"Schleifen und Bedingung","description":"","tags":["preliminaries"],"text":" A Pluto.jl notebook v0.20.19 frontmatter chapter 2 order 2 title \"Schleifen und Bedingung\" layout \"layout.jlhtml\" tags \"preliminaries\" description \"\" using Markdown using InteractiveUtils md\" For loops For Schleifen\" md\"\"\" Nutze `for` zum iterieren über ein `Iterator` `Array` `Range` und dessen Variablen. \"\"\" let Dies ist ein Kommentar Kennzeichunng mittels s 0 Summation aller Zahlen von 1 bis 10 for i in 1 10 s s i end s end md\" Hier ist `1 10` eine range welche die Zahlen von 1 bis 10 repräsentiert. Der `default` standard Abstand zwischen den Zahlen ist 1.\" typeof 1 10 md\"\"\" Wir haben gerade einen `let` Block genutzt um eine Variable `s` zu definieren. Dabei wäre es hier angebracht gewesen eine Funktion `mysum` zu schreiben, welche dann `global` in allen Zellen dieses Notebooks ausgeführt werden kann \"\"\" function mysum n s 0 startwert for i in 1 n s i Äquivalent zu s s i end return s end md\"\"\" Jetzt können wir die Funktion in einer anderen Zelle aufrufen. Zum Beispiel können wir die ersten 100 natürlichen Zahlen aufsummieren. \"\"\" mysum 100 md\" Conditionals `if` Bedingungen `if`\" md\"\"\" Wir können auswerten ob eine Bedingung `true` oder `false` ist \"\"\" a 3 a 5 typeof a 5 md\"\"\" Wir sehen, dass Bedingungen einen `Bool` Ausgabetypen `true` oder `false` besitzen. Basierend auf der boolschen Ausgabe einer Bedingung können wir den Ablauf des Codes mit einer `if` `else` `end` Umgebung lenken. \"\"\" let if a 5 info \"small\" else info \"big\" end end md\"\"\" Falls diese Verzweigung auch noch nicht genügt, kann man eine `if elseif else end` Umgebung basteln. \"\"\" let if a 2 info \"small\" elseif a 2 && a 4 info \"medium\" else info \"big\" end end md\"\"\" Hierbei haben wir Gebrauch von den `&&` Vergleichsoperator gemacht. Dieser vergleicht zwei boolsche Bedingungen links und rechts vom Operator . Sind beide wahr `true` , so ist die Ausgabe abermals `true`. Generell kann man sogar mehrere `elseif` Abfragen in einen solcher Umgebung unterbringen. \"\"\" md\" Mihilfe von Bedingungen können wir nun auch noch eine andere Art und Weise einführen Schleifen zu konstruieren. \" md\"\"\" While loops While Schleifen \"\"\" md\" `While` Schleifen laufen solange bis sie eine Abbruchbedingung erreichen. Dies macht Sie um einiges gefährlicher als eine `For` Schleife, da Sie eventuell nie Ihre Abbruchbedingung erzielen und somit ewig laufen. \" let i 0 while i 5 Ausgabe einer Zeile. Das Zeichen wertet die Variable in den runden Klammern aus und führt es in ein `String` über println \"i ist i und damit kleiner als 5\" i i 1 end end md\"\"\" Anders als bei der `for` Schleife muessen wir hier innerhalb der `while` Schleife einen Iterationsschritt fuer `i` einfuehren. \"\"\" "},{"url":"week_0/plots/","title":"Plots mit Makie","description":"","tags":["preliminaries"],"text":" A Pluto.jl notebook v0.20.19 frontmatter chapter 4 order 4 title \"Plots mit Makie\" layout \"layout.jlhtml\" tags \"preliminaries\" description \"\" using Markdown using InteractiveUtils using CairoMakie let using Makie.FileIO, MeshIO f Figure backgroundcolor RGBf 0.98, 0.98, 0.98 , size 1000, 700 ga f 1, 1 GridLayout gb f 2, 1 GridLayout gcd f 1 2, 2 GridLayout gc gcd 1, 1 GridLayout gd gcd 2, 1 GridLayout axtop Axis ga 1, 1 axmain Axis ga 2, 1 , xlabel \"before\", ylabel \"after\" axright Axis ga 2, 2 linkyaxes axmain, axright linkxaxes axmain, axtop labels \"treatment\", \"placebo\", \"control\" data randn 3, 100, 2 . 1, 3, 5 for label, col in zip labels, eachslice data, dims 1 scatter axmain, col, label label density axtop, col , 1 density axright, col , 2 , direction y end ylims axtop, low 0 xlims axright, low 0 axmain.xticks 0 3 9 axtop.xticks 0 3 9 leg Legend ga 1, 2 , axmain hidedecorations axtop, grid false hidedecorations axright, grid false leg.tellheight true colgap ga, 10 rowgap ga, 10 Label ga 1, 1 2, Top , \"Stimulus ratings\", valign bottom, font bold, padding 0, 0, 5, 0 xs LinRange 0.5, 6, 50 ys LinRange 0.5, 6, 50 data1 sin x^1.5 cos y^0.5 for x in xs, y in ys . 0.1 . randn. data2 sin x^0.8 cos y^1.5 for x in xs, y in ys . 0.1 . randn. ax1, hm contourf gb 1, 1 , xs, ys, data1, levels 6 ax1.title \"Histological analysis\" contour ax1, xs, ys, data1, levels 5, color black hidexdecorations ax1 ax2, hm2 contourf gb 2, 1 , xs, ys, data2, levels 6 contour ax2, xs, ys, data2, levels 5, color black cb Colorbar gb 1 2, 2 , hm, label \"cell group\" low, high extrema data1 edges range low, high, length 7 centers edges 1 6 . edges 2 7 . 0.5 cb.ticks centers, string. 1 6 cb.alignmode Mixed right 0 colgap gb, 10 rowgap gb, 10 brain load assetpath \"brain.stl\" ax3d Axis3 gc 1, 1 , title \"Brain activation\" m mesh ax3d, brain, color tri 1 2 for tri in brain for i in 1 3 , colormap Reverse magma , Colorbar gc 1, 2 , m, label \"BOLD level\" axs Axis gd row, col for row in 1 3, col in 1 2 hidedecorations . axs, grid false, label false for row in 1 3, col in 1 2 xrange col 1 ? 0 0.1 6pi 0 0.1 10pi eeg sum sin pi rand k x k for k in 1 10 for x in xrange . 0.1 . randn. lines axs row, col , eeg, color black, 0.5 end axs 3, 1 .xlabel \"Day 1\" axs 3, 2 .xlabel \"Day 2\" Label gd 1, , Top , \"EEG traces\", valign bottom, font bold, padding 0, 0, 5, 0 rowgap gd, 10 colgap gd, 10 for i, label in enumerate \"sleep\", \"awake\", \"test\" Box gd i, 3 , color gray90 Label gd i, 3 , label, rotation pi 2, tellheight false end colgap gd, 2, 0 n day 1 length 0 0.1 6pi n day 2 length 0 0.1 10pi colsize gd, 1, Auto n day 1 colsize gd, 2, Auto n day 2 for label, layout in zip \"A\", \"B\", \"C\", \"D\" , ga, gb, gc, gd Label layout 1, 1, TopLeft , label, fontsize 26, font bold, padding 0, 5, 5, 0 , halign right end colsize f.layout, 1, Auto 0.5 rowsize gcd, 1, Auto 1.5 f end using PlutoUI md\" Plots \" md\"\"\" Generell gibt es verschiedene `Packages` auch `libraries` oder in deutsch `Pakete` die es uns erlauben `Array`s zu visualisieren. In anderen Worten wir können mittels Paketen uns schicke Graphen von Funktionen etc. erzeugen. In diesem Kurs nutzen wir das Paket Makie.jl bzw. genauer CairoMakie. \"\"\" md\"\"\" Makie.jl Backends GLMakie interaktive Figuren über die GPU CairoMakie statische hochauflösende Figuren Publikationen Reports über CPU WGLMakie Work in Progress interaktive Figuren im Browser mittels WebGL RPRMakie Extrem detailierte 3D Ansichten mit Schattierungen mittels RadeonProRender \"\"\" md\"\"\" Andere Plotting Libraries \"\"\" md\"\"\" Plots.jl, Gadfly.jl, PyPlot.jl, UnicodePlots.jl, PGFPlots.jl, Gnuplot.jl, PlotlyJS.jl \"\"\" md\"\"\" CairoMakie \"\"\" md\"\"\" hint \"Sidefacts\" Das `Makie` framework wird tatächlich vom deutchen \"Federal Ministry of Research und Education\" gefördert und wird unter anderem vom deutschen Wetterdienst benutzt. Das Wort Maki e kommt aus den Japanischen und heißt \"besprenkeltes Bild\". \"\"\" md\"\"\" Als erstes Laden wir das Paket mittels `using CairoMakie` \"\"\" md\"\"\" Als nächstes legen wir fest, was für ein Ausgabetypen die Grafiken haben sollen. Hier wählen wir `svg`, demnach erstellen wir Vektorgrafiken die stechend scharf sind. Bei großen Bildern sollte man zu `png` wechseln, da die Vektorgrafik sonst zu groß wird. \"\"\" CairoMakie.activate type \"svg\" md\" Motivation \" md\" Zum Auswerten von Daten, aber auch für die Intuitionsentwicklung komplexer Sachverhalte ist es äußerst angebracht Visualierungen zu erzeugen. Mit Julia und dem Makie Package mit CairoMakie als Backend ist es sehr leicht möglich sehr komplizierte Daten auszuwerten und Grafiken für Publikationen zu erstellen. Hier ein Beipiel was alles mit Julia und dem Makie Framework so möglich ist \" md\" Eure Aufgabe ist es natürlich nicht solche komplexen Plots bzw. Grafiken am Ende des Kurses erstellen zu können. Vielmehr soll hier eine Einführung stattfinden, nach der Ihr einfache Plots erzeugen könnt, aber auch einen Einblick bekommt wie weitaus komplizitiere Grafiken kreiert werden können. Deshalb werde ich zunächst etwas Hintergrundwissen einführen. Sollte euch das überhaupt gar nicht interessieren könnt ihr direkt zu den Minimalbeispielen springen versteht dann aber wahrscheinlich nicht, was die einzelnen Zeilen bewerkstelligen, da man etwas Hintergrundwissen benötigt. \" md\" Absolutes Minimum \" let Arrays x collect 0. 0.1 2π y sin. x Plot lines x, y end md\" Das funktioniert super, versteckt jedoch so ziemlich alles was im Hintergrund passiert. Mit dem Hintergrundwissen sind wir dann in der Lage deutlich schönere Grafiken zu erstellen. \" md\" Wie baut man Grafiken? \" md\" Die Antwort im Makie Paket ist Stück für Stück wie im echten Leben. Zunächst braucht man eine Leinwand bzw. eine Figur engl. Figure auf der man zeichnen möchte. Eine solche Figur können wir durch den Befehl `Figure ` erstellen. Innerhalb der runden Klammern können wir Optionen festlegen, wie z.B. die Resolution Größe und die Hintergrundfarbe. Aus Demonstrationgründen wähle ich hier eine `moccasin`e Hintergrundfarbe für die Leinwand. \" let Leinwand Figure size 1200, 800 , backgroundcolor moccasin, fontsize 23 Leinwand end md\" Nun haben wir eine Variable `Leinwand` vom Typ `Figure` auf der wir eine Achse engl. Axis bzw. Koordinatensystem zeichnen möchten. Dies können wir gewährleisten durch den `Axis Leinwand Zeile, Spalte , Optionen.. ` Befehl. Die Angabe einer Zeile und Spalte mag zunächst verwirren ist aber notwendig um die Position der `Axis` bzw. Koordinatensystem auf der `Figure` bzw. Leinwand festzulegen. Man kann sich die Leinwand also wie ein 2D `array` vorstellen. Positionen auf der Leinwand an der wir arbeiten wollen müssen wir also durch die Angabe von `Indizes` definieren. Wir nennen unser `Axis` Objekt hier Achse man kann es nennen wie man möchte . Wie wir sehen passt sich die Größe der `Axis` automatisch der Leinwand an. \" let Ausgabetyp Vektorgrafik CairoMakie.activate type \"svg\" Leinwand Figure size 1200, 800 , backgroundcolor moccasin, fontsize 23 Zeichnen eines leeren 2D Kooridnatensystems aud die Leinwand Achse Axis Leinwand 1, 1 , title \"1. Achse\" Für die Anzeige der Grafik müssen wir erneut das `Figure Objekt` hier Leinwand aufrufen Leinwand end md\"\"\" Jetzt können wir in unsere Achse Axis unsere Daten hineinzeichnen. Die Größe der Achse wird sich automatisch den Daten und der Leinwand anpassen. Hier plotten wir zwei 1D `array`s, welche jeweils ein \\sin , \\sin^2 und \\sin darstellen. Wir möchten alle `Array`s in ein gemeinsames Koordinatensystem visualisieren. Dies geschieht durch den Linienplot Befehl `lines Achse, x, y `. Das Ausrufezeichen ` ` zeigt dabei, dass wir aktiv die `Achse` verändern wir zeichnen darauf . Hier werden zusätzlich die `plot` Befehle `scatter ` und `scatterlines ` genutzt um die verschiedenen Funktionen voneinander zu unterscheiden. \"\"\" let CairoMakie.activate type \"svg\" Definition der Leinwand und des Koordinatensystems Leinwand Figure size 1200, 800 , backgroundcolor moccasin, fontsize 23 Achse Axis Leinwand 1, 1 , title \"1. Achse\" Definition der Stützstellen Gitterpunkte und die anschließende Auswertung x collect 0 0.01 2π y sin. x Erstellen eines Linienplots von sin lines Achse, x, y Erstellen eines Scatterplots von sin, an den nur jede 10 te Stützstelle benutzt wird scatter Achse, x 1 10 end , y 1 10 end , color red Erstellen eines Scatterlinienplots von sin^2 x scatterlines Achse, x 1 10 end , y 1 10 end .^2, color black Erneutes Aufrufen der Leinwand zum Ansehen Leinwand end md\" Man stelle sich nun vor wir möchten rechts neben dem Koordinatensystem `Achse` ein weiteres Koordinatensystem `Achserechts` platzieren. Im echten Leben wäre das natürlich ein Problem, denn wir haben keine freie Leinwand mehr. In Makie bzw. CairoMakie ist das kein Problem. Die Koordinatensysteme werden so skaliert, dass beide auf die Leinwand passen. Aber wie kreiere ich nun ein weiteres Koordinatensystem rechts? Wie bereits erwähnt verhält sich die `Figure` wie ein 2D `Array`. Wir können also einfach mit dem Befehl `Achserechs Axis Leinwand 1, 2 , optionen.. ` so tun, als hätte die Leinwand zwei Spalten. Makie bzw. CairoMakie erstellt uns dann diese zweite Spalte. Nun können wir wieder mit den `lines ` und der Angabe des richtigen Koordinatensystems auf der rechten Achse zeichnen. Außerdem sind wir diesmal etwas genauer und geben unseren Linienplot ein `label` welches anschließend in `axislegend position lt ` benutzt wird, um eine Legende links oben lt left top auf der Achse zu positionieren. \" let CairoMakie.activate type \"svg\" Leinwand Figure size 1200, 800 , backgroundcolor moccasin, fontsize 23 Achse Axis Leinwand 1, 1 , title \"1. Achse\" Definition eines zweiten Koordinatensystems in der zweiten Spalte der Leinwand Achserechts Axis Leinwand 1, 2 , title \"2. Achse\" Datenpunkte x collect 0 0.01 2π y sin. x g exp. x Linkes Koordinatensystem lines Achse, x, y scatter Achse, x 1 10 end , y 1 10 end , color red scatterlines Achse, x 1 10 end , y 1 10 end .^2, color black Rechtes Koordinatensystem lines Achserechts, x, g, label \"Exponentialfunktion\", color red, linewidth 3 Erstellen einer Legende, die left top platziert wird axislegend position lt Leinwand end md\"\"\" Erinnerst zu dich noch an die Array Slicing bzw. range Syntax? Wie bereits erwähnt, verhält sich die Leinwand wie ein 2D `array`. Lasst uns also eine 2 te Zeile innerhalb der Leinwand kreieren und ein Koordinatensystem produzieren, welches sich über beide Spalten erstreckt. Dies können wir durch den Befehl `Axis Leinwand 2, 1 2 , optionen.. ` durchführen. Innerhalb der Optionen legen wir außerdem xy Achsenbeschriftung mit `xlabel \"x\"` bzw. `ylabel \"y\"` fest. Außerdem ändern wir die Skalierung der x und y Achse des Koordiantensystems `Achseunten` zu einer logarithmischen Skala 10er Basis . Innerhalb des `lines ` Funktionen führen wir auch Attribute für das Aussehen ein. \"\"\" let CairoMakie.activate type \"svg\" Leinwand Figure size 1200, 800 , backgroundcolor moccasin, fontsize 23 Achse Axis Leinwand 1, 1 , title \"1. Achse\" Achserechts Axis Leinwand 1, 2 , title \"2. Achse\" Dies ist ein Kommentarblock 😄 Definition eines dritten Koordinatensystems in der zweiten Zeile, welches sich über beide Spalten der Leinwand erstreckt. Lesbarkeit fördern durch Zeilenumbruch good practice in the industry Achseunten Axis Leinwand 2, 1 2 , title \"3. Achse Log Log Plot\", xlabel \"x\", ylabel \"f x \", yscale log10, xscale log10 Datenpunkte x collect 0 0.01 2π y sin. x g exp. x lx collect 0.01 0.1 40 h lx.^ 2 k lx.^ 3 Linkes Koordinatensystem lines Achse, x, y scatter Achse, x 1 10 end , y 1 10 end , color red scatterlines Achse, x 1 10 end , y 1 10 end .^2, color black Rechtes Koordinatensystem lines Achserechts, x, g, label \"Exponentialfunktion\", color red, linewidth 3 axislegend Achserechts position lt Unteres Koordinatensystem lines Achseunten, lx, h, color black, linestyle dash, linewidth 3, label L\"x^2\" lines Achseunten, lx, k, color green, linewidth 3, label L\"x^3\" axislegend L\"f x \" position lt Leinwand end md\" Ok genug Details, hier so ein paar Minimalbeispiele um mal eben schnell was zu plotten. \" md\"\"\" Minimalbeispiel 4 Zeiler \"\"\" let CairoMakie.activate type \"svg\" 2 Arrays die gleich lang sind x collect 0 0.01 5 y cos. x . sin. 2x fig Figure size 800, 400 ax Axis fig 1, 1 lines ax, x, y fig end md\"\"\" Minimalbeispiel mit Achsenbeschriftung, Legende, multiple Graphen \"\"\" let CairoMakie.activate type \"svg\" Arrays die gleich lang sind x collect 0 0.01 5 y cos. x . sin. 2x z sin. x fig Figure size 800, 400 ax Axis fig 1, 1 , xlabel \"x\", ylabel \"f x \" lines ax, x, y, label \"Eine tolle Funktion\" lines ax, x, z, label \"Eine andere Funktion\" axislegend fig end md\"\"\" Minimalbeispiel mit \\LaTeX \"\"\" md\"\"\" Häufig ist es schöner eine \\LaTeX Formatierung für die Labels zu nutzen. Dies kann einfach durch ein `L` vor dem String Typen ausgedrückt werden. Z.B. `L\"f x \"`. Natürlich sind auch andere \\LaTeX Befehle abrufbar. Falls ihr noch nie etwas über \\LaTeX gehört habt, keine Sorge Ihr werdet es im Laufe des Studiums garantiert noch beigebracht bekommen und lieben lernen Microsoft Word is eine Pest für die Wissenschaft . \"\"\" let CairoMakie.activate type \"svg\" x collect 0 0.05 4π fig Figure size 800, 400 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"f x \" Man kann als zweites Array auch eine Funktion mittels \"x f x \" übergeben aus der sich das zweite Array aus dem ersten hier x ergibt lines ax, x, x sin 3x cos x 2 x, label L\"\\frac \\sin 3x x \\cos x 2 \" lines ax, x, x cos x x, label L\"\\cos x x\" lines ax, x, x exp x , label L\"e^ x \" axislegend L\"f x \" position rt fig end md\"\"\" 3D Plots \"\"\" md\" Für dreidimensionale Grafiken benötigen wir einen anderen Achsentypen im echten Leben würden wir ja auch ein anderes Koordinatensystem benötigen . Im Makie Paket können wir durch die Funktion `Axis3 .. ` einen 3D Achsenobjekt erzeugen auf den wir anschließend wieder mit anderen Funktionen zeichnen können. Hier z.B. ein `wireframe` oder ein `surface` Plot der Funktion z x,y \\cos x \\sin y Dabei erzeugen wir zunächst ein äquidistantes Gitter für `x` und `y` und werten anschließend mittels array comprehension die Funktionswerte z x, y auf diesen aus. \" let CairoMakie.activate type \"png\" x collect 0 0.02 2π y collect 0 0.02 2π Array comprehension z cos x elem sin y elem for x elem in x, y elem in y fig Figure size 1200, 600 Linker 3D plot ax3w Axis3 fig 1, 1 , title \"Wireframe\" Für den wireframe plot nehmen wir jedes 10te Element innerhalb der Arrays, damit die Gitterlinien nicht so dicht aneinander kleben wireframe ax3w, x 1 10 end , y 1 10 end , z 1 10 end, 1 10 end , color black Rechter 3D plot ax3 Axis3 fig 1, 2 , title \"Schnieke Surface\" surface ax3, x, y, z, colormap berlin fig end md\" Heatmaps & Contours \" md\" 3D Plots sehen zwar sehr eindrucksvoll aus und können sehr gut das qualitative Verhalten von Daten darstellen, jedoch kann man Datenpunkte nicht wirklich ablesen. Aus diesen Grund betrachtet man häufig `heatmap`s oder Höhenlinien Konturen engl. `contour` von 3D Plots, die dann wieder in zwei Dimensionen dargestellt werden können. \" let CairoMakie.activate type \"png\" x collect 0 0.02 2π y collect 0 0.02 2π z cos x elem sin y elem for x elem in x, y elem in y fig Figure size 800, 700 , fontsize 24 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"y\" heat heatmap ax, x, y, z, colormap berlin contour ax, x, y, z, color white, levels 15 farbbar Colorbar fig 1,2 , heat, ticks 1 0.2 1, label L\"z\" fig end md\" More Advanced \" md\"\"\" Der Fantasie sind generell keine Grenzen gesetzt. Hier seht ihr z.B. ein Programm welches elektrische Feldlinien für einen Dipol und ein Quadrupol plottet. Die Farben der Linien deuten die Stärke Norm des E Vektors des elektrischen Feldes an rot stark zu schwarz schwach . Rote Punkte sind positive Ladungen, blaue negative Ladungen. \"\"\" let CairoMakie.activate type \"png\" function E q, rx, ry, x, y d sqrt x rx ^2 y ry ^2 ^3 return q x rx d, q y ry d end function charges nq 2 qs for i in 1 nq q i % 2 2 1 push qs, q, cos 2π i nq , sin 2π i nq end qs end function fieldE x,y Ex, Ey 0, 0 for q in qs ex, ey E q..., x, y Ex ex Ey ey end Point Ex, Ey end Erstellen einer Figur und der Achsen Axis auf denen wir zeichnen möchten. fig Figure size 1200,800 , fontsize 25 ax1 Axis fig 1,1 aspect DataAspect , title \"Feldlinien Dipol\", xgridvisible false, ygridvisible false ax2 Axis fig 1,2 aspect DataAspect , title \"Feldlinien Quadrupol\", xgridvisible false, ygridvisible false Dipol Axis qs charges streamplot ax1, fieldE, 2..2, 2..2 arrow size 12, linewidth 2.5, colorrange 3,3 , colormap berlin Array comprehension um Ladungen zu plotten scatter ax1, Point qs i 2 3 , color qs i 1 0 ? red dodgerblue, markersize 20 for i in eachindex qs limits ax1, 2,2, 2,2 Quadrupol Axis qs charges nq 4 streamplot ax2, fieldE, 2..2, 2..2 arrow size 12, linewidth 2.5, colorrange 3,3 , colormap berlin scatter ax2, Point qs i 2 3 , color qs i 1 0 ? red dodgerblue, markersize 20 for i in eachindex qs limits ax2, 2,2, 2,2 hidedecorations ax1 grid false hidedecorations ax2 grid false fig end TableOfContents "},{"url":"week_0/varfuncs/","title":"Variablen und Funktionen","description":"","tags":["preliminaries"],"text":" A Pluto.jl notebook v0.20.19 frontmatter chapter 1 order 1 title \"Variablen und Funktionen\" layout \"layout.jlhtml\" tags \"preliminaries\" description \"\" using Markdown using InteractiveUtils md\"\"\" Kurzübersicht Julia correct \"Tipp\" 🚧 Man sollte diese Grundlagen nicht als Vorlesungsersatz missbrauchen, in der Vorlesung werden mathematische Konzepte aufgezeigt. 🎬 Ready ? Dann hier eine kleine Einführung \"\"\" md\"\"\" Variablen Wir können mithilfe des ` ` Zuweisungsoperators Variablen definieren. Dabei wird immer der linken Variablen der rechte Wert zugewiesen. Einmal festgelegt können wir dann die Größe Variable auch in anderen Zellen nutzen. \"\"\" x 3 y 2x md\"\"\" warning \"Hinweis\" Das Ausführen einer Zelle erfolgt mit `Shift Enter`. Standardmäßig zeigt Pluto die Ausgabe über der ausgeführten Zelle an. Dies kann man beispielsweise durch ein Semikolon am Ende einer Zeile unterdrücken. \"\"\" z 2x md\"\"\" Um mehrere Zeilen ausführen zu können und dennoch die Variablen global in allen Zellen bereitzustellen, kann eine `begin ... end` Umgebung genutzt werden. \"\"\" begin h 2 p 3 k 3h 2p end k md\"\"\" Möchte man mehrere Zeilen hintereinander ausführen, aber die Sichtbarkeit der Variablen für andere Zellen beschränken so kann man eine `let ... end` Umgebung nutzen.\"\"\" let c 2 d 3 e 3c 2d end md\"\"\" Man definiert die Variablen also lokal in der Zelle `local scope` bzw. `workspace` . Demnach erhalten wir nach Abfrage der Variablen `c` in einer anderen Zelle einen Error. \"\"\" c md\" Mithilfe von `typeof` können wir den Typen einer Variablen abfragen \" typeof y md\"\"\" In diesen Fall ist `y` eine 64Bit Integer Zahl. Es werden demnach 64 Bits Nullen und Einsen bereitgestellt um die ganze Zahl darzustellen. Dazu eventuell an anderer Stelle mehr... \"\"\" md\" Funktionen\" md\"\"\" Häufig braucht man eine bestimmte Prozedur bestimmte Abfolge von Befehlen innerhalb eines Programms immer und immer wieder. Zur Förderung der Lesbarkeit des Codes, aber auch zur Verkürzung ist es dann ratsam Funktionen zu definieren. In Julia gibt es ganz verschiedene Möglichkeiten Funktionen zu deklarieren. Hier sind ein paar aufgezeigt, die alle identisch sind \"\"\" f1 x 2 x f2 x 2 x function f3 x return 2 x end md\" Um eine Funktion aufzurufen und an einer Stelle auszuwerten müssen wir runde Klammern ` ` nutzen.\" f1 10 f2 10 md\"\"\" warning \"Hinweis\" Für längere Funktionen sollte man die Syntax mit den `function` und `end` keyword nutzen. Außerdem kann man natürlich multivariable Funktionen definieren. \"\"\" function g x, y z x 2y return z^2 end g 1, 2 "},{"url":"week_1/assignment_1/","title":"1. Aufgabenblatt","description":"Abgabe 24.10.2025, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"1\" order 1.5 title \"1. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 24.10.2025, 23 59 Uhr\" using Markdown using InteractiveUtils begin using Roots zur Nullstellenberechnung using CairoMakie zum Plotten end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 1. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Erster Kontakt mit dem PC Pool und mit der gewählten Programmiersprache Suchen im Internet Schleifen um Wiederholungen auszuführen Funktionen definieren und grafisch darstellen Heronverfahren als Beispiel einer iterativen Berechnung Projektarbeit und Zusammenarbeit in Kleingruppen \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M. Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir für dieses Aufgabenblatt brauchen werden \" md\" Nach der allerersten Installation von Julia sowie Pluto kann das Laden von folgenden Paketen einige Minuten in Anspruch nehmen. Habt Geduld ☕🫖 \" md\"\"\" Teil 1 Installation \"\"\" md\"\"\" Aufgabe 1a Erkunden Sie ein wenig diese Homepage und installieren Sie `Julia` und `Pluto`, falls noch nicht erfolgt, mithilfe des Bild und Textmaterials auf Ihren eigenen Computer oder den Computer des PC Pools. \"\"\" md\" Teil 2 einfache Eingaben \" md\"\"\" Aufgabe 2a Testen Sie in den Übungsgruppen unter der Verwendung der Pluto Programmierumgebung die folgenden Eingaben nacheinander. Erstellen Sie dazu seperate `Zellen` indem sie untenlinks mit der Maus über eine `Zelle` hovern und ` ` drücken. Eine erste `Zelle` ist bereits vorhanden. `1 4 1 3` `1 4 1 3` `sqrt 36 ` `36^ 1 2 ` ` Dies ist ein Kommentar`. `27^ 1 3 Die Kubikwurzel` Nutzen Sie `shift` `enter` zum Anzeigen eines Ergebnisses oberhalb der Zelle. \"\"\" md\"\"\" Teil 3 Funktionen und Nullstellen \"\"\" md\"\"\" Aufgabe 3a Der Befehl `a 4` definiert die Variable `a` und `b 3` definiert die Variable `b`. Definieren Sie anschließend die Variable `c` aus der Summe `a b`. \"\"\" begin euer code end md\"\"\" Aufgabe 3b Deklarieren Sie mit `f x xˆ2 3` die Funktion f und werten Sie die Funktion an den Stellen x 0 , x 1 und x 2 aus. \"\"\" begin euer code end md\"\"\" Aufgabe 3c Berechnen Sie mit dem oben bereits geladenen Package `Roots.jl` und dem Befehl `find zeros` die Nullstellen der in 3b definierten Funktion f . Nutzen Sie bei Fragen die Live Docs unten rechts indem Sie `find zeros` eintippen. scrollen von Vorteil . \"\"\" begin euer code end md\"\"\" Teil 4 Schleifen und Arrays \"\"\" md\"\"\" Aufgabe 4a Schreiben Sie eine `for` Schleife zur Berechnung der Summe der ersten n Quadratzahlen. Nutzen Sie Informationen von dieser Homepage. \"\"\" begin euer code end md\"\"\" Aufgabe 4b Berechnen Sie unter Verwendung einer `for` Schleife das Produkt aller Elemente des 1D `array`s `J`, wobei `J 3,5,1,8 ` \"\"\" begin euer code end md\"\"\" Aufgabe 4c Erstellen Sie eine `while` Schleife, welche x solange durch 2 dividiert, bis x kleiner als 20 ist. Bestimmen Sie mit dem Programm, wie viele Divisionsschritte erforderlich sind. Testen Sie Ihr Programm für x 100 . \"\"\" begin euer code end md\"\"\" Teil 5 Plotten von Funktionen \"\"\" md\"\"\" Aufgabe 5a Plotten Sie die Funktion f x \\tan x mit Hilfe eines geeigneten Befehls des `CairoMakie` Packages. Experimentieren Sie dabei mit Beschränkungen des x und y Bereichs, um eine aussagekräftige Darstellung zu erhalten, die u.a. die Periodizität sowie das Verhalten der Funktion in der Nähe einer Nullstelle und einer Definitionslücke zeigt. Nutzen Sie hierfür `xlims ` und `ylims `. \"\"\" begin euer code end md\"\"\" Aufgabe 5b Fertigen Sie ein aussagekräftiges Schaubild der Funktionen f x \\exp x , f x \\exp x , f x \\ln x , f x \\sin x , f x \\cos x , f x \\tan x und f x \\cot x an. Verwenden Sie dabei Ihre in 5a erworbenen Kenntnisse. \"\"\" begin euer code end md\"\"\" Teil 6 Heron Verfahren \"\"\" md\"\"\" Aufgabe 6a Schreiben Sie ein Programm zur Berechnung der Wurzel \\sqrt c mit c \\geq 0 , möglichst ohne auf die Vorlage aus der Vorlesung zu schauen. Veranschaulichen Sie die Iterationsschritte durch die grafische Darstellung der Rechtecke nach jedem Schritt. \"\"\" md\"\"\" warning \"Hinweis\" Eine wunderhübsche Animation zum Heron Verfahren ist hier zufinden Animation https de.wikipedia.org wiki Heron Verfahren media Datei Heron wurzelziehen animated2.gif . Zum Visualisieren Ihrer Iterationschritte können Sie die gegebene Funktion `create rectangle` aufrufen. Ein Beispiel zur Anwendung sowie Visualierung finden Sie unten. \"\"\" function create rectangle side1, side2 vertices 0 0 side1 0 side1 side2 0 side2 faces 1 2 3 3 4 1 return vertices, faces end begin CairoMakie.activate type \"png\" fig Figure ax Axis fig 1, 1 , aspect DataAspect mesh ax, create rectangle 3,4 ..., color black, alpha 0.3 mesh ax, create rectangle 2,3 ..., color red, alpha 0.3 fig end begin euer code end md\"\"\" Aufgabe 6b Entwickeln Sie nach dem Prinzip des Heron Verfahrens eine numerische Methode, um die dritte Wurzel \\sqrt 3 c einer vorgegebenen nichtnegativen reellen Zahl c iterativ zu bestimmen. Konstruieren Sie hierzu einen Quader mit dem Volumen c , der iterativ in einen Würfel gleichen Volumens umgewandelt wird. Testen Sie das Verfahren numerisch und prüfen Sie das Ergebnis durch eine Probe. KEINE Visualisierung erforderlich. \"\"\" begin euer code end md\"\"\" Zusatzaufgabe 6c Erweitern Sie diesen Ansatz um die n te Wurzel von c numerisch zu berechnen. Testen Sie das Verfahren wieder numerisch und prüfen Sie das Ergebnis durch eine Probe. \"\"\" begin euer code end md\"\"\" Haus aufgabe 7 Vertiefung des Übungsinhalts \"\"\" md\"\"\" warning \"7 a \" Testen Sie die folgenden Befehle `abs 2 ` `abs 2 ` \"\"\" md\"\"\" warning \"7 b \" Ebenso `floor 2.3 ` `floor 1.7 ` `floor 5.8 ` `floor 2.2 ` \"\"\" md\"\"\" warning \"7 c \" c Definieren Sie die Funktion f x 1 ln x und lösen Sie, dass heißt finden Sie das x für das gilt, f x 2 mittels Umformulierung des Problems in ein Nullstellenproblem und der anschließenden Nutzung von `find zero` des `Roots.jl` Pakets. Nutzen Sie die Documentation unten rechts in Pluto, falls nötig kein Verbrechen . \"\"\" md\"\"\" correct \"Feedback optional \" Verbessern Sie diese Veranstaltung Homepage oder das Aufgabenblatt Wie gefällt Ihnen diese Homepage, das Konzept der Pluto Notebooks? Was sollten wir im Praktikum berücksichtigen? Ist das Aufgabenblatt angemessen? Gibt es Verbesserungsvorschläge zur Vorlesung? \"\"\" Ihr Feedback "},{"url":"week_1/lecture_1/","title":"Heron-Verfahren","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 1 title \"Heron Verfahren\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten CairoMakie.activate type \"png\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 1. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung H. Wallner \"\"\" md\"\"\" Pakete die wir benötigen \"\"\" md\"\"\" Julia als Taschenrechner \"\"\" 3 5 4 12 3 5 3 5 pi md\"\"\" Tipp Latex Noch schöner mittels `\\pi Tab `. Für Experten Julia benutzt einen größeren Unicode Input. \"\"\" π sin pi sin π md\"\"\" Tipp Sinus an mehreren Stellen auswerten Wir koennen die Sinusfunktion auch an mehreren Stellen gleichzeitig auswerten, dafuer muessen wir `sin. x ` nutzen, wobei `x` ein Array bzw. eine Liste an Werten ist an denen wir die Funktion auswerten moechten. \"\"\" let x 0., π 4, π 2, 3 4 π f sin. x end md\"\"\" Ausgabe von Hello World \"\"\" println \"Hello World \" md\"\"\" Bessere Ausgabe In der Plutoumgebung kannst du das `Macro` ` info` für eine bessere Ausgabe wählen. \"\"\" info \"Hello World \" md\"\"\" 5 mal Ausgabe von Hello World \"\"\" md\"\"\" Hinweis Um mehrere Zeilen in einer Plutozelle auszuführen benötigen wir eine `begin .. end` Umgebung. \"\"\" begin info \"Hello world\" info \"Hello world\" info \"Hello world\" info \"Hello world\" info \"Hello world\" end md\"\"\" For Schleife \"\"\" md\"\"\" Eine Schleife mit festen Ende Man iteriert einen Prozess solange, wie eine `dummy` variable in bestimmten Grenzen abgefahren wird. Hier 1 5, also 5 mal \"\"\" for dummy variable die man so nennen kann wie man möchte 1 5 info \"Hello World\" end md\"\"\" Folgenglieder berechnen For Schleife \"\"\" begin a Float64 leeres Array deren Elemente Gleitkommazahlen seien werden for i 1 100 push a, 1 i fügt an a das Element 1 i. end a end scatter a md\"\"\" Andere Variante Mit dem sogenannten array comprehension Muster koennen wir auch einen Vektor Array direkt mit einem for loop erzeugen. Ein Einzeiler \"\"\" a modern 1 i for i 1 100 scatter a modern md\"\"\" Folgenglieder berechnen bis Folgenglieder sehr klein sind While Schleife \"\"\" begin b Float64 i 1 while 1 i 0.05 push b, 1 i i i 1 end b end md\"\"\" Tipp Latex Falls du mit \\LaTeX vertraut bist, kannst du auch `\\geq tab` ≥ anstelle von schreiben. \"\"\" scatter b md\"\"\" Näherungsweise Berechnung der Quadratwurzel von c \"\"\" md\"\"\" Heron Verfahren zur näherungsweisen Berechnung der Quadratwurzel von c. \"\"\" md\"\"\" Iterative Umwandlung eines Rechtecks mit den Seiten x und y c x und Flächeninhalt c in ein flächengleiches Quadrat mit der Seitenlänge \\sqrt c . Startwert der einen Rechteckseite x 1 1 . Somit ist die andere Rechteckseite y 1 c x 1 c 1 Iterative Berechnung der neuen Rechteckseite x k 1 \\frac 1 2 x k c x k Somit ist die andere Rechteckseite y k 1 c x k 1 \\frac 2c x k c x k \"\"\" begin c 2 x 1 while abs x c x 0.000001 info x 0.5 x c x end x end md\"\"\" Probe \"\"\" sqrt 2 "},{"url":"week_2/assignment_2/","title":"2. Aufgabenblatt","description":"Abgabe 07.11.2025, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"2\" order 2.5 title \"2. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 07.11.2025, 23 59 Uhr\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten CairoMakie.activate type \"png\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 2. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe bis siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Festigung von Kenntnissen im grafischen Darstellen Arrays Begriff aus der Informatik bzw. Matrizen Begriff aus der Mathematik Anwenden von Schleifen Konvergenz einer Folge \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M. Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir brauchen werden \" md\" Nach der allerersten Installation von Julia auf deinen PC MAC kann das Laden von folgenden Paketen einige Minuten in Anspruch nehmen. Haben Sie Geduld ☕ \" md\"\"\" Teil 1 Wiederholung Plotten mit Makie \"\"\" md\"\"\" Aufgabe 1a Plotten Sie die Funktion f a x ax^2 im Bereich 4\\leq x \\leq4 für verschiedene Werte des Parameters a . Stellen Sie damit eine Vermutung über den Einfluss des Faktors a auf die Gestalt des Graphen von f a auf, wenn sich a von sehr negativen zu positven Werten verändert. \"\"\" let missing code end md\"\"\" Aufgabe 1b Skizzieren Sie insbesondere f 1 , f 0 und f 1 in einem gemeinsamen Koordinatensystem. \"\"\" let missing code end md\"\"\" Teil 2 Arrays in Julia \"\"\" md\"\"\" Aufgabe 2a Die ersten fünf Folgenglieder einer Folge lauten \\frac 1 2 , \\frac 2 3 , \\frac 3 4 , \\frac 4 5 , \\frac 5 6 . Stellen Sie eine Vermutung über das k te Folgenglied in Abhängigkeit von k auf und geben Sie damit die ersten zwanzig Folgenglieder in Julia an. \"\"\" let missing code end md\"\"\" Aufgabe 2b Wiederholen Sie Aufgabe 2a indem Sie ein k langes Array bzw. einen Vektor mit k Nullen initialisieren. Nutzen Sie anschließend die Indexnotation um das Array den Vektor bis zum k ten Eintrag gemäß der Folge aus 2a aufzufüllen. \"\"\" let missing code end md\"\"\" Aufgabe 2c Erstellen Sie ein 2D Array mit zwei Zeilen, bei der die erste Zeile dem 1D Array aus 2a entspricht. Die Elemente der zweiten Zeile sollen den Indizes des 1D Arrays aus 2a entsprechen. Beispielsweise würde das zu erstellende 2D Array M für das 1D Array 4, 8, 1, 0 wie folgt aussehen M \\left \\begin array cccc 4 & 8 & 1 & 0 \\\\ 1 & 2 & 3 & 4\\end array \\right \"\"\" let missing code end md\"\"\" Teil 3 Konvergenz einer Folge \"\"\" md\"\"\" Aufgabe 3a Stelle mit einer numerischen Berechnung eine Vermutung auf, gegen welche reelle Zahl die Folge x n für n\\to \\infty konvergiert. Die zugehörigen Folgenglieder sind durch x n \\frac 5n^2 3n 4 2n^2 6n gegeben. Programmiere dazu eine Funktion, welche für ein gegebenes n\\in \\mathbb N den Funktionswert x n ausgibt. Plotten Sie eine sinnvolle Anzahl an Folgengliedern. \"\"\" let missing code end md\"\"\" Aufgabe 3b Zeige durch geeignete Umformung, dass die Folge gegen Ihre Vermutung konvergiert. \"\"\" md\"\"\" missing text \"\"\" md\"\"\" Haus aufgabe 4 Fibonacci Folge \"\"\" md\"\"\" Info Die Fibonacci Folge ist hier definiert durch a 0 \\coloneqq 1, a 1 \\coloneqq 2, a k 2 \\coloneqq a k 1 a k mit k \\in \\mathbb N \\lbrace 1, 2, 3, 4 \\ldots \\rbrace \"\"\" md\"\"\" warning \"4 a \" Berechnen Sie alle Folgenglieder bis k 20 mit einer `for` Schleife. \"\"\" begin missing code end md\"\"\" warning \"4 b \" Berechnen Sie alle Folgenglieder a k bis k 20 mit einer `while` Schleife. \"\"\" begin missing code end md\"\"\" warning \"4 c \" Plotten Sie die berechneten Folgenglieder. \"\"\" begin missing code end md\"\"\" warning \"4 d \" Welche Fibonacci Zahlen der ersten 30 Folgenglieder sind ganzzahlig durch 3 teilbar? Nutzen Sie den `mod` Operator. \"\"\" begin missing code end md\"\"\" danger \"4 Zusatz\" Schreiben Sie ein Programm, das das schriftliche Dividieren ganzer Zahlen umsetzt. Die ganzen Zahlen sollen als Ausgangspunkt Ziffer für Ziffer als 1D Array in Julia angegeben werden. Nutzen Sie den `mod` und `div` Operator. \"\"\" let missing code end md\"\"\" correct \"Feedback optional \" Verbessern Sie diese Veranstaltung Homepage oder das Aufgabenblatt Wie gefällt Ihnen diese Homepage, das Konzept der Pluto Notebooks? Was sollten wir im Praktikum berücksichtigen? Ist das Aufgabenblatt angemessen? Gibt es Verbesserungsvorschläge zur Vorlesung? \"\"\" Ihr Feedback "},{"url":"week_2/lecture_2/","title":"Folgen","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 2 title \"Folgen\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten end md\"\"\" Pakete die wir benötigen \"\"\" html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 2. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung H. Wallner \"\"\" md\"\"\" Berechnung iterativ definierter Folgen Am Beispiel der Iterationsvorschrift a n 1 \\frac 1 2 \\left a n \\frac 2 a n \\right zur Berechnung von \\sqrt 2 \"\"\" let a arr Float64 leeres Array, indem wir die Folgenglieder speichern werden. a old 1 sidefact Ihr könnt \"in\" \" \" oder sogar \"∈\" für For Schleifen verwenden, alle sind identisch, manchmal \"liest\" sich aber eine Variante besser als eine andere. for idx in 1 20 a new 1 2 a old 2 a old push a arr, a new a old a new end Plotten CairoMakie.activate type \"png\" fig Figure Erstellen einer Leinwand ax Axis fig 1, 1 Erstellen eines Koordinatensystems auf der Leinwand scatter ax, a arr Erstellen eines Scatterplots auf unseren Koordinatensystem hlines ax, sqrt 2 , linestyle dash, color black Probe ylims ax, 1.4, 1.6 y Bereich der auf den Koordinatensystem gezeigt werden soll fig erneutes Aufrufen der Leinwand, zum Betrachten des Meisterwerks end md\"\"\" Cauchy Eigenschaft einer Folge testen Am Beispiel der Folge a n \\frac 1 n \\sin n \"\"\" md\"\"\" Vorkenntnisse Wir können ein 2D Array voller Nullen durch den `zeros` Befehl erzeugen. Generell lautet der Befehl `zeros TYP, anzahl Zeilen, anzahl Spalten ` Wenn wir keinen Typ angeben, so nimmt Julia Float64 Elemente, also Gleitkommazahlen, als `default` bzw. Standard. \"\"\" zeros 3, 3 sin 1 md\"\"\" Das folgende Programm berechnet die Abstände zwischen den Folgengliedern. Von der symmetrsichen Abstandsmatrix wird nur die Hälfte berechnet, da der Abstand von Punkt 1 zu Punkt 2 der gleiche ist, wie der Abstand von Punkt 2 zu Punkt 1. \"\"\" md\"\"\" warning \"Reminder Cauchy Eigenschaft\" Ausgangspunkt Wir haben eine Folge reeller Zahlen a n n\\in\\mathbb N , diese Folge ist eine Cauchy Folge wenn gilt \\forall \\varepsilon 0 \\quad \\exists N \\in \\mathbb N \\quad \\forall m,n \\geq N \\quad |a m a n| \\varepsilon \"Übersetzt\" Für alle \\varepsilon 0 existiert ein Index N , sodass für zwei Indizes m , n größergleich N der Abstand zwischen den Folgengliedern a m und a n kleiner als \\varepsilon ist. \"\"\" let N 50 a zeros N Initialisierung der Folgenglieder m zeros N, N Initialisierung der Abstandsmatrix for i in 1 N a i 1 i sin i for j in 1 i m i, j abs a i a j end end max abstand zeros N for i in 1 N mtemp m i N, i N max abstand i maximum mtemp end Festlegen des Bildformats CairoMakie.activate type \"png\" Erstellen einer Figur fig Figure fontsize 20 Erstellen eines Koordinatensystems in der ersten Zeile und ersten Spalte der Figur ax1 Axis fig 1, 1 , ylabel L\"a n\", xlabel L\"n\" plotten von Punkten a im Koordinatensystem ax1 scatter ax1, a selbiges Vorgehen bei den anderen Kooridinatensystemem ax2 Axis3 fig 2, 1 2 , azimuth 3 π 4, xlabel L\"i\", ylabel L\"j\", zlabel L\"m ij \", title \"Abstandsmatrix\" surface ax2, m, colormap Spectral 11 ax3 Axis fig 1, 2 , xlabel \"N\", ylabel L\"\\max m, n \\geq N |a m a n|\" scatter ax3, max abstand fig end "},{"url":"week_3/assignment_3/","title":"3. Aufgabenblatt","description":"Abgabe 14.11.2025, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"3\" order 3.5 title \"3. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 14.11.2025, 23 59 Uhr\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten CairoMakie.activate type \"png\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 3. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe bis siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Wiederholung von Folgen und deren Konvergenz Zufallszahlen Intuitives Verstaendnis von Cauchy Folgen Verschachtelte Schleifen \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M.Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir brauchen werden \" md\" Nach der allerersten Installation von Julia auf deinen PC MAC kann das Laden von folgenden Paketen einige Minuten in Anspruch nehmen. Haben Sie Geduld ☕ \" md\"\"\" Teil 1 Folgen, Konvergenz und Schleifen \"\"\" md\"\"\" Aufgabe 1a Wie definiert man die Konvergenz einer Folge gegen einen gegebenen Grenzwert? \"\"\" md\"\"\" missing text x \"\"\" md\"\"\" Aufgabe 1b Erstellen Sie ein 1D Array der ersten 10 Folgenglieder der Folge an a n \\frac n^3 \\sqrt n e^n . \"\"\" begin missing code end md\"\"\" Aufgabe 1c Plotten Sie die ersten 10 Folgenglieder in Abhaengigkeit der Folgenindex. \"\"\" let missing code end md\"\"\" Aufgabe 1d Berechnen Sie unter Nutzung einer `for` Schleife den Mittelwert des 1D Arrays aus 1b . \"\"\" let missing code end md\"\"\" Aufgabe 1e Sei n 0 und p 1 . Schreiben Sie eine Schleife, welche zu n solange 1 addiert, wie p^ n 1 gilt. \"\"\" let missing code end md\"\"\" Aufgabe 1f Erzeugen Sie ein n elementiges Array von gleichverteilten Zufallszahlen zwischen 0 und 7. Bestimmen Sie das arithmetische Mittel dieser Zahlen mit Hilfe einer `for` Schleife. Verwenden Sie hierfuer n \\lbrace 10, 100, 200\\rbrace . Runden Sie ihr Ergebnis sinnvoll. Nutzen Sie den `rand` Befehl. \"\"\" let missing code end md\"\"\" Teil 2 Fixpunktiterationen für Abbildungen \"\"\" md\"\"\" Preliminaries Zu untersuchen ist eine Abbildung T \\mathbb R \\rightarrow \\mathbb R mit T x ax b , x \\in \\mathbb R und gegebenen Konstanten a, b \\in \\mathbb R . Die Linearität von T für den Fall b 0 ermöglicht eine einfache mathematische Analyse. \"\"\" md\"\"\" Aufgabe 2a Erzeugen Sie eine Grafik, in der die Abbildung T , also die Funktion x \\mapsto ax b mit a \\frac 1 2 und b 0 zusammen mit dem Graphen der Funktion x \\mapsto x dargestellt wird. \"\"\" let missing code end md\"\"\" Aufgabe 2b Geben Sie die Definition eines Fixpunktes x der Abbildung T an. Welche Bedeutung hat der Schnittpunkt der beiden Graphen aus a ? Berechnen Sie den Fixpunkt von T . Führen Sie diese Berechnung zuerst für a 1 2 und b 0 durch und danach für beliebige a und b . \"\"\" md\"\"\" missing text X \"\"\" md\"\"\" Aufgabe 2c Überprüfen Sie die Ergebnisse aus Aufgabenteil b numerisch. Nutzen Sie hierfür zunächst wieder die Parameterwerte a \\frac 1 2 und b 0 , und variieren Sie anschließend die Parameter mit a \\lbrace 1.5, 1, 0.5, 0, 0.5, 1, 1.5\\rbrace und b 0 . Schreiben Sie zur Überprüfung eine Fixpunktiteration x k 1 ax k b mit dem Initialisierungswert x 0 1 und 10 Iterationen. Speichern Sie außerdem die Werte der x i sinnvoll. \"\"\" let missing code end md\"\"\" Aufgabe 2d Plotten Sie in einer Abbildung die x n 1 aus Teil c in Abhängigkeit von x n und zeichnen Sie den Polygonzug der Punktfolge x 0, x 1 , x 1, x 1 , x 1, x 2 , x 2, x 2 , \\ldots, x n 1 , x n , x n, x n ein. Welche Schlussfolgerungen kann man aus den verschiedenen Polygonzügen für die verschiedenen Parameterwerte ziehen? \"\"\" let missing code end md\"\"\" Aufgabe 2e Zeigen Sie, dass T für a \\frac 1 2 k kontraktiv ist, wobei die Konstante b beliebig sein kann. Was kann man mit dem Banachschen Fixpunktsatz daraus folgern? \"\"\" md\"\"\" missing text xx \"\"\" md\"\"\" Haus aufgabe 3 Schleifen und Cauchy Folgen \"\"\" md\"\"\" warning \"3a \" Wie definiert man eine Cauchy Folge? Was ist die Besonderheit von Cauchy Folgen im Raum der reellen Zahl? \"\"\" md\"\"\" Hier die Definition von Cauchy Folge hinschreiben. \"\"\" md\"\"\" warning \"3 b \" Die Folge a n n\\in\\mathbb N sei eine iterativ definierte Folge mit a n 1 \\frac 1 2 a n 1 und a 1 1 . Berechnen Sie unter Verwendung einer `for` Schleife das 1000 te Folgenglied. \"\"\" let missing code end md\"\"\" warning \"3 c \" Plotten Sie die ersten 50 Folgenglieder in einem geeignetem Koordinatensystem mit dem `scatter ` Befehl von CairoMakie. \"\"\" let missing code end md\"\"\" warning \"3 d \" Untersuchen Sie die Folge a n n \\in \\mathbb N numerisch. Gegeben sei ein \\varepsilon 0,001 . Ermitteln Sie unter Verwendung einer `while` Schleife ab welchem Index n \\varepsilon die Differenz zwischen zwei aufeinanderfolgenden Folgengliedern kleiner als \\varepsilon ist \\vert a n 1 a n \\vert \\varepsilon . Geben Sie sowohl n \\varepsilon , als auch a n \\varepsilon aus. \"\"\" let missing code end md\"\"\" warning \"3 e \" Bestimmen Sie die ersten 50 Folgenglieder und stellen Sie den maximalen Abstand eines Folgengliedes a i zu den folgenden Folgengliedern grafisch dar \\max i,j |a i a j| , i j\\leq 50 . Nutzen Sie zur Berechnung der Folgenglieder Teilaufgabe b . Wieso genuegt es j i zu betrachten? \"\"\" let missing code end md\"\"\" danger \"3 f Zusatz\" Zeigen Sie, dass es sich bei der in b gegebenen Folge a n n \\in \\mathbb N um eine Cauchy Folge handelt. Zeigen Sie außerdem unter Verwendung der Definition einer konvergierenden Folge, dass die Folge gegen den Grenzwert a 2 konvergiert. \"\"\" let missing code end md\"\"\" Zusatzaufgabe 4 Folgen, bei denen der Abstand benachbarter Folgenglieder gegen Null geht \"\"\" md\"\"\" Preliminaries Alice beobachtet, dass bei allen bisher in der Vorlesung betrachteten konvergenten Folgen a n n\\in\\mathbb N der Abstand benachbarter Folgenglieder gegen Null geht, d.h. \\lim n\\to\\infty |a n 1 a n| 0 gilt. Alice vermutet, dass diese Eigenschaft ausreicht, um die Konvergenz der Folge gegen einen Grenzwert zu garantieren. Bob widerspricht. Wer hat recht?Beantworten Sie die Frage durch die Untersuchung der Folge \"\"\" md\"\"\" 1, 2, 2 \\frac 1 2 , 3, 3 \\frac 1 3 , 3 \\frac 2 3 , 4, \\ldots, n \\frac 1 n , n \\frac 2 n , \\ldots, n \\frac n 1 n , n 1, \\ldots \"\"\" md\"\"\" danger \"4 a Zusatz\" Schreiben Sie ein Programm, das die ersten 100 Folgenglieder dieser Folge erzeugt und ausgibt. \"\"\" let missing code end md\"\"\" danger \"4 b Zusatz\" Plotten Sie die Folgenglieder in Abhängigkeit des Iterationsindex. Plotten Sie zudem den Abstand zwischen benachbarten Folgengliedern in Abhängigkeit des Iterationsindex. Beantworten Sie, wer recht hat und begründen Sie Ihre Antwort. \"\"\" let missing code end md\"\"\" danger \"4 c Zusatz\" Beweisen Sie, dass es sich bei der Folge nicht um eine Cauchy Folge handelt. \"\"\" md\"\"\" Text xx \"\"\" "},{"url":"week_3/lecture_3/","title":"Fixpunkt-Iterationen","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 3 title \"Fixpunkt Iterationen\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten CairoMakie.activate type \"svg\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 3. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung H. Wallner \"\"\" md\"\"\" Pakete die wir benötigen \"\"\" md\"\"\" Iteratives Lösen von Gleichungen Fixpunkt Iteration \"\"\" md\"\"\" Fixpunktiteration und der Banach sche Fixpunktsatz Am Beispiel der Fixpunktgleichung \\cos x x . Die Vorraussetzungen des Banach schen Fixpunktsatzes welcher Existenz und Eindeutigkeit eines Fixpunktes x \\star gewaehrleistet werden hinterher in der Vorlesung geprueft. Nachfolgend finden wir den Fixpunkt durch mehrfaches Iterieren und visualieren das Problem ausserdem grafisch. \"\"\" let Linke Seite der Fixppunktgleichung f u cos u In Julia können wir auch Funktionen selbst an Funktionen übergeben. Für eine bessere Performance und Lesbarkeit geben wir außerdem die Typen der Inputargumente an. function fixpoint fun Function, x Float64, ϵ tol Float64 ϵ ϵ tol 1. x old x while ϵ ϵ tol x new fun x old ϵ abs x new x old x old x new end return x old end Hier übergeben wir der funktion fixpoint, unsere funktion f u cos u , unseren Anfangswert x, und eine Toleranz ϵ tol. y fixpoint f, 0.5, 1e 5 info \"Der Fixpunkt ist y \" info \"Der absolute Fehler ist f y y \" plotten, erstellen einer Figur fig Figure size 400, 200 erstellen eines Koordinatensystems auf der Figur ax Axis fig 1, 1 , xticks 0 0.1 1, yticks 0 0.2 1 Visualisieren der rechten und linken Seite der Gleichung lines ax, 0., 1. , 0., 1. , linewidth 1, label L\"x\" lines ax, 0 0.01 1, cos. 0 0.01 1 , color black, linewidth 1, label L\"\\cos x \" Markieren der gefundenen Loesung vlines ax, y, color red, linewidth 1, label L\"x \\star \\cos x \\star \" axislegend position lc eine Legende left centered lc xlims ax, 0, 1 fig end "},{"url":"week_4/assignment_4/","title":"4. Aufgabenblatt","description":"Abgabe 21.11.2024, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"4\" order 4.5 title \"4. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 21.11.2024, 23 59 Uhr\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten CairoMakie.activate type \"png\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 4. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe bis siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Ableitung und deren Approximation durch Differenzenqoutient Linearisierung von Funktionen Veranschaulichung einer k Kontraktion rekursiv definierte Funktionen \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M.Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir brauchen werden \" md\"\"\" Teil 1 Approximation der Ableitung durch Differenzenqoutienten \"\"\" md\"\"\" Aufgabe 1a Plotten Sie die Funktionen f x \\sin x sowie g x \\cos x im Definitionsbereich x\\in \\pi, \\pi mit 100 Stützstellen. \"\"\" let missing code end md\"\"\" Aufgabe 1b Berechnen Sie den rechtsseitigen Differenzenquotienten von f x an den in a verwendeten Stützstellen. Beachten Sie dabei, dass nicht jede der 100 Stützstellen einen rechten Nachbarn besitzt. Sie erhalten 99 Differenzenquotienten. Plotten Sie die Differenzenquotienten an den jeweiligen Stützstellen und vergleichen Sie dies mit dem Graphen der Funktion g x . \"\"\" let missing code end md\"\"\" Aufgabe 1c Linearisieren Sie die Funktion f x um den Entwicklungspunkt x \\frac \\pi 4 und plotten Sie die entsprechende Gerade sowie f x in der Umgebung von x . \"\"\" let missing code end md\"\"\" Teil 2 Visualisierung der k Kontraktion beim Banach schen Fixpunktsatz \"\"\" md\"\"\" Aufgabe 2a Wenden Sie eine gegebene Funktion f x \\cos x auf die Elemente eines Vektors bzw. Arrays X mit 100 äquidistanten Punkten im Interval \\pi, \\pi an. \"\"\" begin missing code end md\"\"\" Aufgabe 2b Plotten Sie die Abstaende d f x ,f y |f x f y | aller Kombinationen der in a berechneten Funktionswerte in Abhaengigkeit von x und y . \"\"\" let missing code end md\"\"\" Aufgabe 2c Plotten Sie \\max x,y d f^n x ,f^n y in Abhängigkeit des Iterationsindex n 1,2,\\dots,10 , wobei f^1 x f x , f^2 x f f x , f^3 x f f f x , \\dots die iterative Anwendung von f bezeichnet. \"\"\" let missing code end md\"\"\" Haus aufgabe 3 Fakultaet \"\"\" md\"\"\" Preliminaries Für alle natürlichen Zahlen n ist n \\coloneqq 1·2·3·\\ldots·n \\prod k 1 ^ n k , als das Produkt der natürlichen Zahlen von 1 bis n definiert. Außerdem wird das leere Produkt als 1 definiert und es gilt 0 \\coloneqq 1 . Die Fakultät lässt sich auch rekursiv definieren n \\begin cases 1,&n 0\\\\ n\\cdot n 1 ,&n 0.\\end cases \"\"\" md\"\"\" warning \"3a \" Berechnen Sie in einer for Schleife n als Produkt der ersten n natürlichen Zahlen ohne Verwendung des Julia Befehls `factorial`. Weisen Sie hierzu n außerhalb der Schleife verschiedene Werte ≥ 1 zu. Geben Sie mit dem ` info` Befehl n und n aus. \"\"\" let missing code end md\"\"\" warning \"3b \" Erstellen Sie aus dem Programm von 3a eine Funktion faku, welcher eine natürliche Zahl n übergeben wird und die den Wert von n ausgibt. \"\"\" let missing code end md\"\"\" danger \"3c Zusatz\" Zeigen Sie mittels vollständiger Induktion, dass \\sum k 1 ^ n k · k n 1 − 1 gilt. Nutzen Sie dafür die rekursive Definition der Fakultät. \"\"\" md\"\"\" text \"\"\" md\"\"\" Zusatz Aufgabe 4 Banachscher Fixpunktsatz \"\"\" md\"\"\" Preliminaries Sei g x \\sqrt 1 x eine Abbildung mit x\\in 1,2 \\subset\\mathbb R . Betrachten Sie die Iterationen x n 1 g x n mit dem Startwert x 0 1 , um numerisch einen Fixpunkt von g x zu bestimmen. Rechtfertigen Sie durch Nachprüfen der Voraussetzungen des Banach'schen Fixpunktsatzes, dass die Iteration gegen einen eindeutigen Fixpunkt konvergiert \"\"\" md\"\"\" danger \"4a Zusatz\" Zeigen Sie, dass die Funktion g das abgeschlossene Interval 1,2 auf sich selbst abbildet, d.h. g 1,2 \\rightarrow 1,2 . \"\"\" md\"\"\" text \"\"\" md\"\"\" danger \"4b Zusatz\" Zeigen Sie, dass g k kontraktiv ist. Tipp Hier kann eine binomische Formel verwendet werden. \"\"\" md\"\"\" text \"\"\" md\"\"\" danger \"4c Zusatz\" Wieviele Iterationen benötigt man um sicherzustellen, dass das Resultat einen kleineren Fehler als 10^ 3 besitzt? \"\"\" md\"\"\" text \"\"\" "},{"url":"week_4/lecture_4/","title":"Logistische Abbildung","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 4 title \"Logistische Abbildung\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using SymbolicNumericIntegration using Symbolics using CairoMakie end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 4. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung des Codes und Bemerkungen H. Wallner \"\"\" md\"\"\" Pakete die wir benötigen \"\"\" md\"\"\" Mathematische Funktionen definieren und Ableitungen symbolisch berechnen \"\"\" begin variables x f x^2 4 end md\"\"\" Um den Funktionswert bei x 2 zu berechenen müssen wir x entsprechend einsetzen substitute . Dies geschieht duch ein `Dictionary` indem wir mit `x 2` angeben wie x ersetzt werden soll. \"\"\" begin substitute f, Dict x 2 end md\"\"\" Die Ableitung können wir symbolisch ermitteln durch \"\"\" begin Dx Differential x Deklarieren eines Differentials nach x f prime Dx f Zusammenfuehren ABER noch nicht auswerten des Differential f prime expand derivatives f prime Ausfuehren der Ableitung end begin substitute f prime, Dict x 1 end md\"\"\" Zum symbolischen Integrieren koennen wir den `integrate` Befehl nutzen. \"\"\" let integrate f end md\"\"\" Eventuell merkt man hier, dass Julia nicht fuer symbolische Berechnungen konzipiert wurde. Persoenlich empfiehle ich hierfuer Wolfram Alpha bzw. Mathematica. \"\"\" md\"\"\" Beispiel einer nichtlinearen Abbildung Logistische Gleichung \"\"\" md\"\"\" x n 1 f x n \\lambda x n 1 x n \"\"\" md\"\"\" In Abhängigkeit von einem Parameter \\lambda zeigt die Logistische Gleichung Fixpunkte oder periodisches Verhalten und chaotisches Verhalten. Nachfolgend werde wir alle drei Optionen aufzeigen. Als erstes definieren wir eine Funktion `logisticmap` die neben den Iterationsschritten auch einen Polygonzug erstellt. \"\"\" function logisticmap λ Float64, a start Float64, iters Integer x coords Float64 y coords Float64 a old a start a Float64 a old push x coords, a start push y coords, 0. for iter in 1 iters a new λ a old 1 a old push a, a new Cobweb push x coords, a old push x coords, a old push y coords, a old push y coords, a new a old a new end Zusammenfügen der Koordinaten zu einer Matrix coords hcat x coords, y coords return a, coords end md\"\"\" 1. & 2. Szenario Fixpunkt & Periodisches Verhalten \"\"\" md\"\"\" Zunaechst den Fixpunkt Fall sowie das periodische Verhalten. \"\"\" let a1, coords1 logisticmap 2.5, 0.5, 20 a2, coords2 logisticmap 3.3, 0.5, 20 v 0. 0.01 1. CairoMakie.activate type \"png\" fig Figure size 800, 800 axtleft Axis fig 1, 1 , title \"Folge der logistischen Abbildung\", xlabel L\"n\", ylabel L\"x n\" scatter axtleft, a1, label L\"\\lambda 2.5\" axislegend axtleft axtright Axis fig 1, 2 , title \"Cobweb Diagramm Logistische Abbildung\", xlabel L\"x n\", ylabel L\"f x n \" Wenn man den lines oder scatter Befehl eine Matrix übergibt 2D Array hier coords, dann interpretieren die Befehle die erste Zeile als x Werte und die zweite Zeile als y Werte. lines axtright, coords1 lines axtright, 0, 1 , 0, 1 lines axtright, v, 2.5. v . 1 . v axbleft Axis fig 2, 1 , xlabel L\"n\", ylabel L\"x n\" scatter axbleft, a2, label L\"\\lambda 3.3\" axislegend axbleft, position rc axbright Axis fig 2, 2 , xlabel L\"x n\", ylabel L\"f x n \" lines axbright, coords2 lines axbright, 0, 1 , 0, 1 lines axbright, v, 3.3. v . 1 . v fig end md\"\"\" 3. Szenario Chaotisches Verhalten \"\"\" let a1, coords1 logisticmap 3.7, 0.5, 20 v 0. 0.01 1. CairoMakie.activate type \"png\" fig Figure size 800, 400 axtleft Axis fig 1, 1 , title \"Folge der logistischen Abbildung\", xlabel L\"n\", ylabel L\"x n\" scatter axtleft, a1, label L\"\\lambda 3.7\" axislegend axtleft axtright Axis fig 1, 2 , title \"Cobweb Diagramm Logistische Abbildung\", xlabel L\"x n\", ylabel L\"f x n \" lines axtright, coords1 lines axtright, 0, 1 , 0, 1 lines axtright, v, 2.5. v . 1 . v fig end md\"\"\" Zusammenfassung der Szenarien in einen Bifurkationsdiagramm \"\"\" md\"\"\" Von besonderen mathematischen Intresse sind uebrigens die Verweigungspunkte bei der es zu Aufspaltungen des qualitativen Verhaltens kommt. Diese Punkte werden Bifurkationspunkte genannt. Dies uebersteigt jedoch den Umfang dieser Veranstaltung 😶‍🌫️. \"\"\" let function logisticmap λ Float64, a start Float64, iters Integer a old a start a Float64 a old for iter in 1 iters a new λ a old 1 a old push a, a new a old a new end return a end function bifurcation logisticmap λ start Float64, λ end Float64, a start Float64, n trans Integer, n iter Integer Da wir die Größe der Ausgangsarrays schon kennen, empfiehlt es sich diese schon vorab zu initialisieren. Dies fördert die Performance Δλ 0.005 dim λ ceil Int64, λ end λ start Δλ 1 dim R n iter n trans 1 results zeros Float64, dim λ, dim R λs zeros Float64, dim λ, dim R In Julia können wir mittels enumerate arr gleichzeitg über Indizes und Elemente des arr iterieren. Wir \"nummerieren\" den container über den wir iterieren for idx, λ in enumerate λ start Δλ λ end result logisticmap λ, a start, n iter res steady result n trans 1 end results idx, . res steady λs idx, . λ . ones length res steady end return results, λs end R, Λ bifurcation logisticmap 2.2, 4., 0.5, 500, 1000 Aus unseren Matrizen konstruieren wir nun 2D Punkte. Diese Punkte speichern wir dann in einen Array points. In Julia kurz und bündig points Point2 Λ idx , R idx for idx in eachindex R da Vektorgrafiken bei so vielen Punkten sehr groß werden, wählen wir \"png\" als Output CairoMakie.activate type \"png\" fig Figure size 800, 400 , fontsize 14 ax Axis fig 1, 1 , xlabel L\"\\lambda\", ylabel L\"x \\star \" scatter ax, points, markersize 3 vlines ax, 2.5, color green, label \"fixpoint\" vlines ax, 3.3, color orange, label \"periodic\" vlines ax, 3.7, color red, label \"chaos\" axislegend ax, position lt fig end "},{"url":"week_5/assignment_5/","title":"5. Aufgabenblatt","description":"Abgabe 28.11.2024, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.20 frontmatter homework number \"5\" order 5.5 title \"5. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 28.11.2024, 23 59 Uhr\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten using ForwardDiff using Symbolics end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 5. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe bis siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Iterationen, die nicht gegen einen Fixpunkt konvergieren Nullstellenbestimmung durch Linearisiserung Wiederholung der Ableitungsberechnung \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M. Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir brauchen werden \" md\"\"\" Teil 1 Die logistische Abbildung \"\"\" md\"\"\" Preliminaries Es soll die Abbildung f \\mathbb R \\rightarrow \\mathbb R mit f x \\lambda x 1 x und \\lambda\\in 1, 4 iterativ angewendet werden. \"\"\" md\"\"\" Aufgabe 1a Errechnen Sie analytisch per Hand die Fixpunkte x der Abbildung f , d.h. Lösungen von x f x . \"\"\" md\"\"\" text \"\"\" md\"\"\" Zusatz aufgabe 1b Berechnen Sie die Funktion f x und die Ableitung von f x in der Umgebung von x 1 \\frac 1 \\lambda , d.h. an den Stellen x 1 \\frac 1 \\lambda \\delta , wobei \\delta sowohl positive als auch negative Werte annehmen kann. \"\"\" md\"\"\" text \"\"\" md\"\"\" Zusatz aufgabe 1c Die iterative Anwendung der Abbildung f konvergiert unter geeigneten Bedinungen gegen den Fixpunkt x 1 \\frac 1 \\lambda . Zeigen Sie diese Konvergenz für den Spezialfall \\lambda 2 . Wählen Sie hier für die Startwerte x 0 nahe genug am Fixpunkt und verwenden Sie einen in der Vorlesung behandelten Satz. \"\"\" md\"\"\" test \"\"\" md\"\"\" Aufgabe 1d Zeigen Sie durch ein Beispiel, dass sich die ersten 3 iterativ berechneten Werte x 1 , x 2 und x 3 mit dem Startwert x 0 0.75 und \\lambda 3.4 vom Fixpunkt wegbewegen. \"\"\" let missing code end md\"\"\" Zusatz aufgabe 1e Welche Schlussfolgerung kann aus b d erhalten werden? Wie kann dies bewiesen werden? \"\"\" md\"\"\" text \"\"\" md\"\"\" Zusatz aufgabe 1f Zeigen Sie, dass für \\lambda 3.4 und Startwerte x 0\\in 0,1 die zweifache Hintereinanderausführung der Abbildung f , d.h. die Abbildung g x f f x einen Fixpunkt besitzt gegen den die iterative Anwendung der Abbildung g konvergiert. Man nennt dies einen stabilen Grenzzyklus mit Periode 2. \"\"\" md\"\"\" text \"\"\" md\"\"\" Teil 2 Nullstellen via Newton \"\"\" md\"\"\" Aufgabe 2a Es soll eine Nullstelle der Funktion f \\mathbb R \\rightarrow \\mathbb R , x\\mapsto f x und f x x^3 2x^2 x 1 numerisch im Intervall 2,0 ermittelt werden. Berechnen Sie die ersten 8 Iterierten des Newton Verfahrens mit dem Startwert x 0 0 . Implementieren Sie dazu das Newton Verfahren. Das Programm soll dabei den Startwert x 0 , eine Funktion z.B. f x und die Anzahl der durchzuführenden Iterationsschritte einlesen. Eine Bestimmung von Ableitungen soll mit Hilfe von dem Paket \"ForwardDiff\" erfolgen oder an das Computerprogramm übergeben werden. \"\"\" md\"\"\" Zusatz teil 3 Steffensen Verfahren \"\"\" md\"\"\" Preliminaries Das Steffensen Verfahren zur Nullstellenberechnung der Funktion f x ist definiert durch die Iteration \"\"\" md\"\"\" x n 1 x n \\frac f x n ^2 f x n f \\left x n f x n \\right , \\ \\ n \\in \\mathbb N 0. \"\"\" md\"\"\" und benötigt keine Ableitungen. \"\"\" md\"\"\" Zusatz aufgabe 3a Erstellen Sie eine Julia Funktion zur Durchführung dieses Verfahrens. Die Julia Funktion soll dabei einen Startwert x 0 , eine Funktion und die Anzahl der durchzuführenden Iterationsschritte einlesen. \"\"\" let missing code end md\"\"\" Zusatz aufgabe 3b Bestimmen Sie einmal mittels des Newton und einmal mittels des Steffensen Verfahren die Approximation der Nullstelle der Funktion f x x^2 1 mit Startwert x 0 1.5 nach 10 Iterationsschritten. Speichern Sie die Ergebnisse nach jedem Iterationsschritt mit Hilfe einer Zeilenmatrix und stellen Sie diese anschließend graphisch dar. Beachten Sie hierbei, auch den Startwert abzubilden. \"\"\" let missing code end md\"\"\" Zusatz aufgabe 3c Führen Sie Aufgabe b auch für die Funktion f x 38x^3 1 durch, mit Startwert x 0 2 nach 5 Iterationsschritten. Vergleichen Sie Ihr Ergebnis mit dem aus Aufgabenteil b . Was stellen Sie fest? \"\"\" let missing code end md\"\"\" Haus aufgabe 4 Miniprojekt \"\"\" md\"\"\" Preliminaries Ableitungsberechnung für eine Funktion mit einer Variablen. Gegeben sei die Funktion f x \\frac 1 2 x^3 x^2 1 . \"\"\" md\"\"\" Aufgabe 4a Plotten Sie die Funktion f x in einem sinnvollen Bereich. \"\"\" let missing code end md\"\"\" Aufgabe 4b Berechnen Sie die ersten zwei Ableitungen von f x symbolisch mit dem Package `Symbolics` und plotten Sie diese in das Schaubild aus a . \"\"\" let missing code end md\"\"\" Aufgabe 4c Berechnen Sie mit der Definition der Ableitung als Grenzwert eines Differenzenquotienten die erste Ableitung von f x an der Stelle x 0 1 . Formulieren Sie hierzu den Differenzenquotient und berechnen Sie anschließend den Grenzwert analytisch. \"\"\" md\"\"\" test \"\"\" md\"\"\" Aufgabe 4d Bestimmen Sie die Nullstellen und die kritischen Punkte von f x numerisch mit den Newton Verfahren ein Punkt x\\in \\mathbb R heißt kritischer Punkt einer differenzierbaren Funktion f \\mathbb R \\to \\mathbb R , wenn f' x 0 gilt . \"\"\" let missing code end md\"\"\" Aufgabe 4e Bestimmen Sie den Typ der kritischen Punkte und zeichnen Sie die Punkte zusammen mit dem Graph der Funktion in ein Koordinatensystem ein gilt für einen kritischen Punkt x\\in \\mathbb R einer zweimal differenzierbaren Funktion f \\mathbb R \\to \\mathbb R die Ungleichung f'' x 0 bzw. f'' x 0 , so besitzt f an der Stelle x ein lokales Minimum bzw. Maximum . Zusatz Lokale Maxima sollen rot, lokale Minima blau dargestellt werden. \"\"\" let missing code end "},{"url":"week_5/lecture_5/","title":"Newton-Verfahren","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.20 frontmatter order 5 title \"Newton Verfahren\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using Symbolics, ForwardDiff symbolisches differenzieren using CairoMakie zum Plotten end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 5. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung H. Wallner \"\"\" md\"\"\" Die Newton Methode \"\"\" md\"\"\" hint \"Auch Newton Raphson genannt\" Auch wenn wir heute häufig von der Newton Methode sprechen, den Iterationsformalismus fand erst Joseph Raphson, 1690. \"\"\" md\"\"\" Die Newton Methode ist ein Verfahren zum Lösen eines Nullstellenproblems. Nachfolgend werden wir Lösungen für 2 x^2 suchen. Dazu wird das Problem in das Nullstellenproblem 0 x^2 2 umgeformt. Ganz allgemein sucht man immer x \\star wobei h x \\star 0 gilt. \"\"\" md\"\"\" Die Iteration der Newton Raphson Methode lautet x n 1 x n \\frac h x n h^\\prime x n man benötigt also Informationen über die Ableitung der Funktion h x . In unseren Fall gilt h x x^2 2, \\quad h^\\prime x 2x Außerdem benötigt man einen Anfangswert x 0 , hier setzen wir x 0 1 . Somit können wir bereits nach x \\star suchen. \"\"\" let h x x^2 2 h prime x 2x x 1. for iter in 1 5 x x h x h prime x end info \"x ist x , und somit das Quadrat von x x^2 \" end md\"\"\" Zum Vergleich die analytische Lösung \"\"\" sqrt 2 md\"\"\" Eventuell ist es hilfreich das Newton Verfahren zu visualisieren, da die Methode leicht geometrisch zu verstehen ist. Hier starten wir bei x 0 3.9 . \"\"\" let CairoMakie.activate type \"png\" h x x^2 2 h prime x 2x x collect 0 0.1 4 x old 3.9 points Point2 fig Figure fontsize 14, size 500, 400 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"h x \" hlines ax, 0, color black lines ax, x, h. x , label L\"h x \", linewidth 3, color cornflowerblue for iter in 1 5 x new x old h x old h prime x old push points, Point2 x old, 0 push points, Point2 x old, h x old scatter ax, x old, 0, color grey scatter ax, x old, h x old , color tomato lines ax, x old, x old , 0, h x old , color grey lines ax, x old, x new , h x old , 0 , color tomato, linestyle dash x old x new end ylims ax, 4.5, 15 xlims ax, 0, 4 fig end md\"\"\" Man bildet also die Tangente an h x n und schaut sich dann die Nullstelle der Tangente an. Die dann abermals als Ausgangspunkt für die nächste Iteration genutzt wird. Die Anfangsbedingung ist entscheidend, man kann zum Beispiel auch im negativen Bereich anfangen und gelangt zur anderen Nullstelle der Parabel. Im Laufe des Semesters werden wir darauf zurueckkommen und ueber Basins of attraction reden. Grob und unsauber gesprochen Welche Anfangsbedingungen zur welchen Nullstelle fuehren, quasi Einzugsgebiete. \"\"\" let let CairoMakie.activate type \"png\" h x x^2 2 h prime x 2x x collect 4 0.1 0 x old 3.7 points Point2 fig Figure fontsize 14, size 500, 400 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"h x \" hlines ax, 0, color black lines ax, x, h. x , label L\"h x \", linewidth 3, color cornflowerblue for iter in 1 5 x new x old h x old h prime x old push points, Point2 x old, 0 push points, Point2 x old, h x old scatter ax, x old, 0, color grey scatter ax, x old, h x old , color tomato lines ax, x old, x old , 0, h x old , color grey lines ax, x old, x new , h x old , 0 , color tomato, linestyle dash x old x new end ylims ax, 4.5, 15 xlims ax, 4, 0 fig end end md\"\"\" Newton mit Abbruchbedingung \"\"\" let h x x^2 2 h′ x 2x ′ \\prime TAB x 1. iter 0 while abs 2 x^2 1e 7 iter 1 x x h x h′ x end info \"x ist x und wir brauchten iter Iterationen.\" end md\"\"\" Newton Methode mit symbolischen Differenzieren \"\"\" md\"\"\" Nun wollen wir eine Funktion `newtonmethod` schreiben, der wir unsere Funktion übergeben, dessen Nullstelle wir suchen, eine geforderte Toleranz und einen Startwert. Damit wir nicht durcheinander kommen, können wir in der Methode angeben, von welchen Typ die Eingabewerte sind. Dies geschieht durch den ` ` Operator. `Typing` hat im Allgemeinen nicht nur leserliche Gründe sondern fördert auch die Performance. In Julia gibt es ganz verschiedene Typen man hat sogar die Option selbst welche zu definieren. \"\"\" function newtonmethod h Function, tol Float64, x0 Float64 h′ x ForwardDiff.derivative h, x Ausrechnen der Ableitung x new x0 x old x0 tol 1 damit nicht sofort while Schleife erfüllt wird while abs x old x new tol x old x new x new x old h x old h′ x old end return x new end let x star newtonmethod x x^2 2, 1e 8, 1. info \"x ist x star und x^2 ist somit x star^2 \" end md\"\"\" Jetzt können wir uns beliebige Probleme ausdenken. Z.B. das altbekannte Problem x \\cos x , welches wir zuvor mit einer Fixpunktiteration gelößt haben. \"\"\" let x star newtonmethod x cos x x, 1e 8, 0.5 info \"x ist x star und cos x ist cos x star \" end "},{"url":"week_6/assignment_6/","title":"6. Aufgabenblatt","description":"Abgabe 05.12.2024, 23:59 Uhr","tags":["assignments","homeworks"],"text":" A Pluto.jl notebook v0.20.19 frontmatter homework number \"6\" order 6.5 title \"6. Aufgabenblatt\" layout \"layout.jlhtml\" tags \"assignments\", \"homeworks\" description \"Abgabe 05.12.2024, 23 59 Uhr\" using Markdown using InteractiveUtils begin using CairoMakie using Symbolics end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" 6. Aufgabenblatt Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Abgabe bis siehe StudIP im \"Aufgaben\" Menü der Vorlesung. \"\"\" md\"\"\" Lernziele Bisektionsmethode zur Nullstellenbestimmung Anwendung des Taylor Polynoms zur Approximation von Funktionen \"\"\" md\"\"\" Vorlesung Prof. J. Starke Praktika M.Beller, C. Rönnfeld, N. Kruse & H. Wallner \"\"\" md\"\"\" Fügen Sie in der unteren Zelle Ihre Daten ein und drücken Sie anschließend `shift` `enter` zum Ausführen der Zelle. Nun sollte sich oben alles angepasst haben. \"\"\" student Dict \"name\" \"Max Mustermann\", \"fach\" \"Studiumsfach\", \"matrikelnr\" \"1234\" md\"\"\" Autor der Abgabe student \"name\" , MNR student \"matrikelnr\" , Fach student \"fach\" \"\"\" md\" Pakete die wir brauchen werden \" md\"\"\" Teil 1 Wiederholung Ableitungen \"\"\" md\"\"\" Aufgabe 1a Bilden Sie mit dem Package \"Symbolics\" die erste, zweite und dritte Ableitung von f x \\arctan x g x x\\sin x \"\"\" let missing code end md\"\"\" Aufgabe 1b Plotten Sie die Funktionen in einer Figur mit zwei Koordinatensystemem. In den Koordinatensystemen sollen jeweils f x und g x und deren erste bis dritte Ableitung eingezeichnet werden. Nutzen Sie verschiedene `color` und `linestyle` Optionen. \"\"\" let missing code end md\"\"\" Teil 2 Bisektions Algorithmus \"\"\" md\"\"\" Preliminaries Ist f auf \\left a,b\\right \\subseteq D stetig und gilt f a f b 0 , so besitzt f im Intervall a, b mindestens eine Nullstelle. \"\"\" md\"\"\" Aufgabe 2a Machen Sie sich mit der Kontrollstruktur `if else end` vertraut und schreiben Sie eine Funktion `bisec` zur Anwendung des Bisektionsalgorithmus auf f x x^5 x 1 im Intervall a,b 0,1 zur näherungsweisen Bestimmung einer Nullstelle x . \"\"\" md\"\"\" warning \"Pseudocode Bisection\" Initialisierung x 1 a \\, x 2 b \\, f 1 f x 1 \\, f 2 f x 2 \\, \\varepsilon 10^ 3 . Prüfung der Existenz einer Nullstelle f 1\\cdot f 2 0 Iteration Berechnung der Intervallmitte x M x 1 x 2 2. Berechnung des Funktionswertes f M f x M . Festlegung des neuen Intervalls Falls f M f 2 0 d.h. Nullstelle zwischen x M und x 2 , dann x 1 x M und f 1 f M, Falls f M f 2 0 d.h. Nullstelle zwischen x 1 und x M , dann x 2 x M und f 2 f M. Abbruchbedingung Falls |x 1 x 2| epsilon, dann x x M, STOP. Falls |x 1 x 2| epsilon, dann weiter mit Iteration. \"\"\" begin missing code end md\"\"\" Aufgabe 2b Plotten Sie die Funktion `f` mit dem `CairoMakie` Package und markieren Sie die berechnete Nullstelle. \"\"\" let missing code end md\"\"\" Zusatz aufgabe 2c Stellen Sie die Funktionsweise des Algorithmus graphisch dar. Erweitern Sie dafür die Funktion `bisec`, sodass Sie jeden berechneten Funktionswert mit zugehörigem x Wert speichern. Tragen Sie anschließend die Punkte in einen Koordinatensystem ein. \"\"\" let missing code end md\"\"\" Haus aufgabe 3 Taylor \"\"\" md\"\"\" Preliminaries Approximieren Sie die Kosinus Funktion \\cos x mit einem Taylor Polynom p n x in einer Umgebung von x 0 , d.h. es soll gelten p n x \\approx \\cos x . \"\"\" md\"\"\" warning \"3a \" Bestimmen Sie, wie in der Vorlesung besprochen, das Taylor Polynom p n x zur Approximation der Kosinus Funktion bis zur Ordnung n , welche den größten Exponenten des Polynoms in x angibt. \"\"\" md\"\"\" missing text \"\"\" md\"\"\" warning \"3b \" Implementieren Sie die Berechnung des Taylor Polynoms der Kosinus Funktion als Funktion von x sowie der Ordnung n . \"\"\" begin missing code end md\"\"\" warning \"3c \" Testen Sie Ihr Programm fuer die Werte x \\in \\lbrace 0, \\pi 2, \\pi \\rbrace und n 20 . \"\"\" let missing code end md\"\"\" warning \"3d \" Plotten Sie in einem gemeinsamen Koordinatensystem die Approximationen p n x , wobei n 4, 6, 10 , sowie f x \\cos x . Nutzen Sie dazu ein äquidistantes Gitter x\\in 5,5 mit 100 Stützstellen. \"\"\" let missing code end "},{"url":"week_6/lecture_6/","title":"Taylorreihen und Bisektion","description":"","tags":["assignments"],"text":" A Pluto.jl notebook v0.20.19 frontmatter order 6 title \"Taylorreihen und Bisektion\" layout \"layout.jlhtml\" tags \"assignments\" description \"\" using Markdown using InteractiveUtils begin using CairoMakie zum Plotten using Symbolics Symybolisches Berechnen using TaylorSeries Symbolische Taylorreihe CairoMakie.activate type \"png\" end html\"\"\" h1 style \"text align center\" Computerorientierte Mathematik, Algorithmen & Strukturen h1 div style \"text align center\" p style \"font weight bold font size 35px font variant small caps margin 0px\" Code 6. Vorlesung in Julia p p style \"font size 20px \" Universität Rostock, Institut für Mathematik, Winter 2025 26 br p div \"\"\" md\"\"\" Vorlesung Prof. J. Starke Übersetzung und Bemerkungen H. Wallner \"\"\" md\"\"\" Pakete die wir benötigen \"\"\" md\"\"\" Taylor Polynome \"\"\" md\"\"\" Für das Erstellen von Taylor Polynomen nutzen wir das Package `Symbolics.jl`. Dabei legen wir uns zunaechst eine symbolische Variable `x` an. Anschliessend koennen wir die Funktion festlegen, hier `exp x `, in welche Variable die Approximation durchgefuehrt werden soll, hier `x` und welche Ordnungen beruecksuechtigt werden sollten, hier `0 3`, also nullter bis zur dritten Ordnung. \"\"\" let variables x expr1 taylor exp x , x, 0 3 info expr1 info substitute expr1, Dict x 1 end md\"\"\" Wir koennen auch einen anderen Entwicklungspunkt festlegen, im vorherigen Beispiel haben wir die Funktion `exp x ` um x 0 0 entwickelt und anschliessend diese Approximation an x 1 ausgewertet. Nun entwickeln wir `exp x ` um x 0 1 . Dies wird in der Funktion `taylor` durch ein weiteres Argument an dritter Stelle gewaehrleistet. \"\"\" let variables x expr2 taylor exp x , x, 1, 0 3 info expr2 info substitute expr2, Dict x 1 end md\"\"\" Um nur die Koeffizienten der Taylorreihe als 1D Array zu bekommen, nutzt man \"\"\" let variables x taylor coeff exp x , x, 0 1 4 end let variables x taylor coeff exp x 1 , x, 0 1 4 beachte exp x 1 an 0 zu entwickeln ist das gleiche wie exp x an 1 zu entwickeln end md\"\"\" Kritische Punkte \"\"\" md\"\"\" Der Punkt x 0 wird kritischer Punkt von f genannt, wenn \\mathrm D \\vert x x 0 f 0 gilt. Also die erste Ableitung von f x nach x , an der Stelle x x 0 null ist. Wir nutzen die Schulnotation f^ \\prime x 0 0 \"\"\" md\"\"\" Wenn f^ \\prime\\prime x 0 0 , so ist x 0 ein lokales Maximum von f . Wenn f^ \\prime\\prime x 0 0 , so ist x 0 ein lokales Minimum von f . Wenn f^ \\prime\\prime x 0 0 , so ist x 0 , so kann mit den vorliegenden Informationen keine Schlussfolgerung gezogen werden. \"\"\" md\"\"\" Beispiel \"\"\" begin variables u f 1 3 u^3 u end u arr collect 2 0.01 2 y arr substitute f, Dict u x elem .val for x elem in u arr let fig Figure size 800, 400 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"y\" lines ax, u arr, y arr fig end D Differential u f prime D f f prime expanded expand derivatives f prime md\"\"\" Die kritischen Punkte sind somit x 0 1 und x 1 1 . \"\"\" f prime prime expand derivatives D D f substitute f prime prime, Dict u 1 md\"\"\" negativ, also ein lokales Maximum \"\"\" substitute f prime prime, Dict u 1 md\"\"\" positiv, also ein lokales Minumum \"\"\" md\"\"\" Taylorreihe \"\"\" md\"\"\" Als naechstes schauen wir uns Taylorreihen bis zur zweiten Ordung an den kritischen Punkten an. \"\"\" g 1 3 u^3 u md\"\"\" Taylorreihe entwickelt um u 0 1 \"\"\" t pos taylor g, u, 1, 0 2 md\"\"\" Taylorreihe entwickelt um u 0 1 \"\"\" t neg taylor g, u, 1, 0 2 begin fig Figure size 800, 400 x arr all collect 2 0.05 2 x arr neg collect 2 0.05 1 x arr pos collect 1 0.05 2 ax Axis fig 1, 1 , xlabel L\"x\", ylabel L\"y\" lines ax, x arr all, substitute g, Dict u x .val for x in x arr all , label L\"f x \", color black lines ax, x arr pos, substitute t pos, Dict u x .val for x in x arr pos , linestyle dash, linewidth 2, label L\"Taylor, x 0 1\", color cornflowerblue lines ax, x arr neg, substitute t neg, Dict u x .val for x in x arr neg , linestyle dash, linewidth 2, label L\"Taylor, x 0 1\", color red scatter ax, 1, substitute g, Dict u 1 .val, color red scatter ax, 1, substitute g, Dict u 1 .val, color cornflowerblue axislegend nbanks 3 xlims ax, 2, 2 ylims ax, 0.7, 0.7 fig end md\"\"\" Bisektionsalgorithmus zur Nullstellenberechnung \"\"\" function bisection a Real, b Real, ϵ tol Real, f Function Ausgabe einer Fehlermeldung bei ungültigen Grenzen, hier nutzen wir das assert macro assert f a f b 0. \"f a f b 0\" low a up b while up low ϵ tol mid low up 2 if f low f mid 0 low mid else up mid end end return low up 2 end md\"\"\" Altbekanntes Beispiel \"\"\" md\"\"\" Testen wir den Bisektionsalgorithmus wieder am altbekannten Beispiel cos x x . \"\"\" let v x cos x x x star bisection 2, 3, 1e 6, v end "}]